var E0001 = "E:E0001:รูปแบบวันที่ไม่ถูกต้อง";
var E0002 = "E:E0002:วันที่สิ้นสุดการใช้งานต้องมากกว่าวันที่เริ่มต้น";
var E0003 = "E:E0003:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ";
var E0004 = "E:E0004:กรุณาระบุเงื่อนไขอย่างใดอย่างหนึ่ง";
var E0005 = "E:E0005:กรุณาระบุทะเบียนรับเลขที่";
var E0006 = "E:E0006:กรุณาระบุวันเดือนปีที่รับ";
var E0007 = "E:E0007:กรุณาระบุรหัสผู้ประกอบการ";
var E0008 = "E:E0008:กรุณาระบุวันที่";
var E0009 = "E:E0009:กรุณาระบุประเภทผู้ประกอบการ";
var E0010 = "E:E0010:กรุณาระบุรหัสโรงอุตสาหกรรม";
var E0011 = "E:E0011:กรุณาระบุ";
var E0012 = "E:E0012:กรุณาเลือก";
var E0013 = "E:E0013:รหัสสำนักงานสรรพสามิต ต้องบันทึกเป็นตัวเลขขนาด 6 หลัก";
var E0014 = "E:E0014:ไม่พบรหัสสำนักงานสรรพสามิต ที่ระบุ";
var E0015 = "E:E0015:กรุณาระบุเดือน";
var E0016 = "E:E0016:กรุณาระบุปี";
var E0017 = "E:E0017:กรุณาระบุผู้ประกอบการ";
var E0018 = "E:E0018:กรุณาเลือกรายการสินค้าจากแถบรายการสินค้า";

// ใช้ในกรณีต้องการให้ระบุค่ามากกว่า 
// เช่น showMsg(E0019) + " 0.00" หมายถึง "ค่าที่บันทึกต้องมากกว่า 0.00"
// หรือ showMsgField(E0019, "อัตราภาษีมูลค่าเพิ่ม") + " 0.00" หมายถึง "อัตราภาษีมูลค่าเพิ่ม ค่าที่บันทึกต้องมากกว่า 0.00"
var E0019 = "E:E0019:ค่าที่บันทึกต้องมากกว่า";
// ใช้ในกรณีต้องการให้ระบุค่ามากกว่า
// เช่น showMsg(E0019) + " 0.00" หมายถึง "ค่าที่บันทึกต้องมากกว่า 0.00"
// หรือ showMsgField(E0019, "อัตราภาษีมูลค่าเพิ่ม") + " 0.00" หมายถึง "อัตราภาษีมูลค่าเพิ่ม ค่าที่บันทึกต้องมากกว่า 0.00"
var E0020 = "E:E0020:ต้องไม่มากกว่า";
var E0021 = "E:E0021:ปี พ.ศ. ที่ระบุต้องอยู่ระหว่าง ปี พ.ศ. 2450 - พ.ศ. 2599";
var E0022 = "E:E0022:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก วันที่ เดือน และปีไม่สอดคล้องกันเช่น\n31042545 ไม่ถูกต้องเนื่องจากเดือน 04 หรือ เมษายน มีเพียง 30 วันเท่านั้น หรือ\n29022545 ไม่ถูกต้องเนื่องจากปีพ.ศ. 2545 เดือนกุมภาพันธ์มี 28 วันเป็นต้น";
var E0023 = "E:E0023:ระบุเดือนไม่ถูกต้อง ให้ระบุเป็น 01 - 12 เท่านั้น";
var E0024 = "E:E0024:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก\n ความยาวมากกว่า หรือน้อยกว่า 8 ตัวอักษร";
var E0025 = "E:E0025:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก\n1. ประกอบด้วยตัวอักษรอื่นนอกจากตัวเลข  0-9 \n2. มีเครื่องหมายอื่นๆประกอบอยู่ด้วยเช่น / เป็นต้น";
var E0026 = "E:E0026:วันที่ที่บันทึกต้องน้อยกว่าหรือเท่ากับวันที่ในระบบ";
var E0027 = "E:E0027:ต้องไม่น้อยกว่า";
var E0029 = "E:E0029:วันเดือนปีเกิดไม่ถูกต้อง";
var E0030 = "E:E0030:วันที่ที่บันทึกต้องมากกว่าหรือเท่ากับวันที่ในระบบ";
var E0031 = "E:E0031:กรุณาเข้าระบบใหม่";
var E0032 = "E:E0032:กรุณาตรวจสอบข้อมูลให้ถูกต้อง";
var E0033 = "E:E0033:กรุณาตรวจสอบข้อมูลการยกเลิกให้ถูกต้อง";
var E0034 = "E:E0034:ยกเลิกแบบไม่สำเร็จ";
var E0035 = "E:E0035:ไม่สามารถเพิ่มรายการได้";
var E0036 = "E:E0036:วันที่รับเอกสารต้องไม่น้อยกว่าวันที่แจ้งความ";
var E0037 = "E:E0037:กรุณาเลือกไฟล์ประเภทรูปภาพเท่านั้น (JPG, PNG, GIF, BMP)";
var E1001 = "E:E1001:พบข้อผิดพลาดขณะค้นหาข้อมูล"; 
var E1002 = "E:E1002:ค่าสูงสุดที่บันทึกได้คือ 100.00";
var E1003 = "E:E1003:มูลค่าสูงสุดของขั้นต้องมากกว่ามูลค่าต่ำสุดของขั้น";
var E1004 = "E:E1004:รหัสกลุ่มรหัสรายได้ต้องมีสถานะเป็นกลุ่มรายได้เท่านั้น"; 
var E1005 = "E:E1005:ไม่สามารถบันทึกเป็นค่าเดียวกับรหัสรายได้"; 
var E1006 = "E:E1006:รหัสกลุ่มหมวดสินค้าไม่สามารถเป็นค่าเดียวกับรหัสหมวดสินค้าได้"; 
var E1007 = "E:E1007:รหัสกลุ่มหมวดสินค้าต้องเป็นรหัสของกลุ่มหมวดสินค้าเท่านั้น"; 
var E1008 = "E:E1008:ประเภทของวัตถุดิบไม่ตรงกับประเภทของโครงสร้าง"; 
var E1009 = "E:E1009:รหัสวัตถุดิบไม่สามารถใช้ได้ในหมวดสินค้านี้"; 
var E1010 = "E:E1010:รหัสวัตถุดิบนี้ถูกนำไปใช้แล้ว"; 
var E1011 = "E:E1011:รหัสกลุ่มสินค้าต้องเป็นกลุ่มสินค้าน้ำมันเท่านั้น"; 
var E1012 = "E:E1012:ค่าสูงสุดที่บันทึกได้คือ 100.00";

var E2001 = "E:E2001:รหัสอ้างอิงจากเมนูไม่สามารถเป็นค่าเดียวกับรหัสเมนูระบบงานได้"; 
var E2002 = "E:E2002:รหัสอ้างอิงจากเมนูต้องเป็นรหัสของเมนูหลักเท่านั้น"; 

var E3001 = "E:E3001:เลขควบคุมเอกสารที่ระบุ เป็นแบบที่ไม่สามารถบันทึกข้อมูลบัญชีผู้เสียภาษีได้"; 
var E3002 = "E:E3002:สถานะของแบบใหม่ไม่สามารถเป็นค่าเดียวกับสถานะของแบบเดิมได้"; 
    
var E4001 = "E:E4001:เลขประจำตัวผู้เสียภาษีอากรจะต้องบันทึกเป็นตัวเลขจำนวน 10 หลัก";
var E4002 = "E:E4002:กรุณาระบุข้อมูลที่ต้องการลบ";
var E4003 = "E:E4003:ไม่พบข้อมูลจาก MOI";
var E4004 = "E:E4004:ไม่พบข้อมูลจาก MOC"; 
var E4005 = "E:E4005:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากมีข้อมูลสถานประกอบการนี้ในฐานข้อมูลแล้ว";
var E4006 = "E:E4006:เลขทะเบียนสรรพสามิตต้องมีความยาว 10 หลักเท่านั้น";
var E4007 = "E:E4007:ระบุช่วงวันที่ไม่ถูกต้อง 'จดทะเบียนวันที่ต้องน้อยกว่าหรือเท่ากับ ถึงวันที่' ";
var E4008 = "E:E4008:ยังไม่ทำการพิมพ์ทะเบียนสรรพสามิต ไม่สามารถทำรายการนี้ได้"; //ใช้ใน REGE0105
var E4009 = "E:E4009:พบข้อมูลของผู้ประกอบการอยู่ในระบบแล้ว ต้องการปรับปรุงแทนข้อมูลเก่าหรือไม่";//ใช้ในREGE...
var E4010 = "E:E4010:มีข้อมูลของผู้ประกอบการอยู่ในระบบแล้ว";//ใช้ในREGE0001...
var E4011 = "E:E4011:พบข้อมูลชื่อสถานประกอบการอยู่ในระบบแล้ว ต้องการปรับปรุงแทนข้อมูลเก่าหรือไม่";//ใช้ในREGE...
var E4012 = "E:E4012:มีข้อมูลชื่อสถานประกอบการอยู่ในระบบแล้ว";//ใช้ในREGE0002...
var E4013 = "E:E4013:เลขใบอนุญาตตั้งคลังสินค้าทัณฑ์บนที่บันทึกไม่ถูกต้องตามหลักเกณฑ์";
var E4014 = "E:E4014:เลขใบอนุญาตตั้งสถานแสดงรถยนต์เพื่อขายที่บันทึกไม่ถูกต้องตามหลักเกณฑ์";
var E4015 = "E:E4015:เลขทะเบียนสรรพสามิตที่บันทึกไม่ถูกต้องตามหลักเกณฑ์";
var E4016 = "E:E4016:กรุณาระบุรายชื่อรถยนต์ที่อยู่ในสถานแสดงรถยนต์เพื่อขาย";
var E4017 = "E:E4017:ไม่พบข้อมูลเลขที่ใบอนุญาต ไม่สามารถทำรายการนี้ได้"; 
var E4018 = "E:E4018:กรุณาระบุรายชื่อและที่อยู่ของสถานแสดงรถยนต์เพื่อขาย";
var E4019 = "E:E4019:สถานแสดงรถยนต์เพื่อขายนี้มีเลขที่ใบอนุญาตในระบบแล้ว ";
var E4020 = "E:E4020:เลขใบอนุญาตไม่ถูกต้องตามหลักเกณฑ์";
var E4021 = "E:E4021:วันที่ยกเลิกต้องมากกว่าวันที่จดทะเบียน";
var E4022 = "E:E4022:เลขทะเบียนสรรพสามิต ยังไม่มีการจดทะเบียนใหม่ไม่สามารถทำรายการนี้ได้";
var E4023 = "E:E4023:เลขทะเบียนสรรพสามิต ถูกยกเลิกการใช้งานแล้ว";
var E4024 = "E:E4024:วันที่โอนกิจการต้องมากกว่าวันที่จดทะเบียน";
var E4025 = "E:E4025:เลขทะเบียนสรรพสามิตถูกยกเลิกและยังค้างการชำระภาษี";
var E4026 = "E:E4026:ถ้าไม่มีจำนวนเงินให้ระบุ 0 เท่านั้น"; 
var E4027 = "E:E4027:กรุณาระบุรายการที่ต้องการแก้ไข"; 
var E4028 = "E:E4028:ยังไม่เคยทำรายการของแบบฟอร์มนี้ ไม่สามารถแก้ไขข้อมูลได้"; 
var E4029 = "E:E4029:กรุณาระบุชื่อผู้รับโอน"; 
var E4030 = "E:E4030:ยังไม่ทำการพิมพ์ใบอนุญาต ไม่สามารถทำรายการนี้ได้"; // ใช้ใน REGE0109
var E4031 = "E:E4031:คลังสินค้าทัณฑ์บนนี้ มีใบอนุญาตแล้ว"; // ใช้ใน REGE0108
var E4032 = "E:E4032:เลขที่ใบอนุญาตนี้ยังไม่ทำการอนุมัติให้ใช้งาน หรือยังไม่ได้พิมพ์ใบอนุญาต ไม่สามารถทำรายการนี้ได้"; // ใช้ใน REGE0110
var E4033 = "E:E4033:เลขที่ใบอนุญาต ถูกยกเลิกการใช้งานไม่สามารถทำรายการนี้ได้"; // ใช้ใน REGE0111 //พี่เจ เติม ถูกยกเลิก...  ตอนหลัง
var E4034 = "E:E4034:ผู้รับโอนเป็นบุคคลคนเดียวกันกับผู้โอนไม่ได้ กรุณาตรวจสอบ"; 
var E4035 = "E:E4035:ทะเบียนสรรพสามิต ไม่ใช่ประเภทโรงอุตสาหกรรมรถยนต์  ไม่สามารถทำรายการนี้ได้";  
var E4036 = "E:E4036:ไม่พบข้อมูลทะเบียนสรรพสามิต ไม่สามารถทำรายการนี้ได้";
var E4037 = "E:E4037:เลขที่ใบอนุญาตที่ขอเลิกยังไม่ถูกอนุมัติ  ไม่สามารถทำรายการนี้ได้";  
var E4038 = "E:E4038:เลขทะเบียนสรรพสามิต ถูกยกเลิกการใช้งานแล้วไม่สามารถทำรายการนี้ได้";  
var E4039 = "E:E4039:ยังมีใบอนุญาตที่ยังไม่ถูกยกเลิก ไม่สามารถทำรายการยกเลิกเลขทะเบียนนี้ได้"; 
var E4040 = "E:E4040:เลขที่ใบอนญาตนี้ไม่ได้อยู่ในสถานะที่จะทำรายการนี้ได้"; 
var E4041 = "E:E4041:เลขที่ใบอนุญาตยังไม่ได้รับการอนุมัติ  ไม่สามารถทำรายการนี้ได้"; 
var E4042 = "E:E4042:ประเภทสถานประกอบการ ไม่ใช่ประเภทคลังสินค้าทัณฑ์บน กรุณาตรวจสอบ";
var E4043 = "E:E4043:เลขที่ใบอนุญาตถูกยกเลิกและยังค้างการชำระภาษี";
var E4044 = "E:E4044:กรุณาระบุแบบฟอร์มที่ต้องการพิมพ์สำเนา";
var E4045 = "E:E4045:ไม่สามารถจดทะเบียนได้ เนื่องจากหมายเลขเครื่องขายเครื่องดื่มยังมีการใช้งานอยู่";
var E4046 = "E:E4046:วันที่เริ่มผลิตสินค้าหรือบริการต้องมากกว่าวันที่ยื่นแบบ";
var E4047 = "E:E4047:มีข้อมูลเลขประจำตัวผู้เสียภาษีและเลขประจำตัวประชาชนในฐานข้อมูลแล้ว กรุณาตรวจสอบ";
var E4048 = "E:E4048:มีข้อมูลเลขประจำตัวผู้เสียภาษีในฐานข้อมูลแล้ว ต้องการบันทึกเป็นรายใหม่หรือไม่";
var E4049 = "E:E4049:มีข้อมูลเลขประจำตัวผู้เสียภาษีในฐานข้อมูลแล้ว กรุณาตรวจสอบ";
var E4050 = "E:E4050:ต้องแจ้งก่อนเลิกกิจการ ไม่น้อยกว่า 15 วัน ต้องการเลิกกิจการหรือไม่";
var E4051 = "E:E4051:วันที่เลิกกิจการต้องไม่เกิน 30 วันนับตั้งแต่วันที่ยื่นแบบ";
var E4052 = "E:E4052:ต้องดำเนินการจดทะเบียนใหม่ภายใน 7 นับจากวันที่รับโอน ต้องการจดทะเบียนใหม่หรือไม่";
var E4053 = "E:E4053:ต้องดำเนินการจดทะเบียนใหม่ภายใน 30 นับจากวันที่ตาย ต้องการจดทะเบียนใหม่หรือไม่";
var E4054 = "E:E4054:ต้องยื่นคำขอโอนกิจการฯ ก่อนวันขอโอนกิจการ ไม่น้อยกว่า 15 วัน ต้องการยื่นคำขอโอนกิจการฯหรือไม่";
var E4055 = "E:E4055:ชื่อกลุ่มบริษัทซ้ำ";
var E4056 = "E:E4056:พื้นที่สถานประกอบกิจการ ไม่ตรงกับพื้นที่สรรพสามิต ไม่สามารถจดทะเบียนได้";
var E4057 = "E:E4057:วันที่อนุมัติ ต้องมากกว่าหรือเท่ากับวันเดือนปีที่รับ";
var E4058 = "E:E4058:ต้องดำเนินการจดทะเบียนใหม่ภายใน 30 นับจากวันที่ยื่นขอย้าย ต้องการจดทะเบียนใหม่หรือไม่";
var E4059 = "E:E4059:ไม่สามารถขอใบรับแทน ขอโอน ขอย้าย หรือขอเลิกกิจการได้ เนื่องจากเลขทะเบียนนี้อยู่ต่างพท.";
var E4060 = "E:E4060:เลขทะเบียนสรรพสามิตนี้ไม่ได้อยู่ในสถานะที่จะทำรายการนี้ได้"; 
var E4061 = "E:E4061:ไม่สามารถพิมพ์ใบทะเบียนนี้ได้ เนื่องจากเลขทะเบียนนี้ยังไม่ได้ทำการจดทะเบียนใหม่"; 
var E4062 = "E:E4062:ไม่สามารถพิมพ์ใบทะเบียนนี้ได้ เนื่องจากเลขทะเบียนนี้ถูกยกเลิกแล้ว"; 
//var E4063 = "E:E4063:ไม่สามารถทำรายการนี้ได้ เนื่องจากยังไม่ได้พิมพ์ใบทะเบียน"; 
var E4063 = "E:E4063:เลขทะเบียนสรรพสามิตนี้ยังไม่ได้พิมพ์ใบทะเบียน ไม่สามารถทำรายการนี้ได้"; 
var E4064 = "E:E4064:ไม่สามารถทำรายการนี้ได้ เนื่องจากมีข้อมูลค้างการจดทะเบียนอยู่ กรุณาตรวจสอบ"; 
var E4065 = "E:E4065:ไม่สามารถทำรายการได้ เนื่องจาก ยังไม่ได้ทำการยื่นเรื่องขอโอนผู้ประกอบการ หรือย้ายสถานประกอบการ"; 
var E4066 = "E:E4066:ไม่สามารถจดทะเบี่ยนได้ เนื่องจากมีเลขทะเบียนสรรพสามิต(เก่า)ในฐานข้อมูลแล้ว กรุณาตรวจสอบ"; 
var E4067 = "E:E4067:วันที่ผู้ประกอบการเสียชีวิต ต้องน้อยกว่าหรือเท่ากับวันเดือนปีที่รับแบบ"; 
var E4068 = "E:E4068:พื้นที่สถานประกอบกิจการ ไม่ตรงกับพื้นที่สรรพสามิต \nไม่สามารถแก้ไขข้อมูลผู้ประกอบการหรือข้อมูลสถานประกอบการได้";
var E4069 = "E:E4069:มีข้อมูลสาขาที่ของผู้ประกอบการรายนี้อยู่ในระบบแล้ว";
var E4070 = "E:E4070:วันที่ขอยกเลิกกิจการต้องมากกว่าวันที่รับแบบ";
var E4071 = "E:E4071:มีข้อมูลโรงอุตสาหกรรมนี้อยู่ในฐานข้อมูลแล้ว กรุณาตรวจสอบ";
var E4072 = "E:E4072:มีข้อมูลเลขประจำตัวประชาชนในฐานข้อมูลแล้ว กรุณาตรวจสอบ";
var E4073 = "E:E4073:ไม่พบข้อมูลผู้ประกอบการรายย่อย";
var E4074 = "E:E4074:ไม่พบข้อมูลสถานประกอบการ";
var E4075 = "E:E4075:ไม่สามารถพิมพ์ใบอนุญาตได้ เนื่องจากยังไม่ผ่านการอนุมัติใบอนุญาตตั้งคลังสินค้าทัณฑ์บน";
var E4076 = "E:E4076:มีข้อมูลชื่อ-ที่อยู่ผู้ประกอบการอยู่ในระบบแล้ว";//ใช้ในREGE0001...
var E4077 = "E:E4077:ไม่สามารถยกเลิกผู้ประกอบการได้ เนื่องจากมีการอ้างใช้งานแล้ว";
var E4078 = "E:E4078:มีประเภทสถานประกอบการนี้อยู่ในระบบแล้ว ไม่สามารถบันทึกได้ กรุณาตรวจสอบ";
var E4079 = "E:E4079:ไม่สามารถคืนสถานะของเลขทะเบียนสรรพสามิตได้ \nเนื่องจากไม่พบข้อมูลของรายการก่อนยกเลิก";
var E4080 = "E:E4080:ไม่สามารถทำรายการได้ เนื่องจากเลขทะเบียนนี้อยู่ต่าง พท.";
var E4081 = "E:E4081:ไม่สามารถทำรายการได้ เนื่องจากท่านได้ยื่นแบบ ภษ.01-15 แล้ว";
var E4082 = "E:E4082:ท่านไม่มีสิทธิ์อนุญาตรายการนี้";
var E4083 = "E:E4083:ส่งอนุมัตไม่สำเร็จ";
var E4084 = "E:E4084:กรุณาระบุผลการตรวจสอบ Artswork";

var E4085 = "E:E4085:กรุณาตรวจสอบประเภทของไฟล์";
var E4086 = "E:E4086:กรุณาตรวจสอบขนาดของไฟล์";
var E4087 = "E:E4087:ปีรับจดทะเบียนลักษณะที่ ต้องมีขนาด 4 หลัก";
var E4088 = "E:E4088:ระบุปีรับจดทะเบียนลักษณะที่ ต้องไม่เกิน ปีปัจจุบัน + 1";
var E4089 = "E:E4089:กรุณาระบุสัญญาวางประกันค่าภาษี";

var E5000 = "E:E5000:ไม่พบข้อมูล" ;
var E5001 = "E:E5001:กรุณาระบุรหัสกลุ่มสินค้า" ;
var E5002 = "E:E5002:กรุณาระบุชื่อกลุ่มสินค้า" ;
var E5003 = "E:E5003:กรุณาระบุรหัสประเภทสินค้า/บริการ" ;
var E5004 = "E:E5004:กรุณาระบุชื่อประเภทสินค้า/บริการ" ;
var E5005 = "E:E5005:กรุณาระบุรหัสเครื่องหมายการค้าหลัก" ;
var E5006 = "E:E5006:กรุณาระบุชื่อเครื่องหมายการค้าหลัก" ;
var E5007 = "E:E5007:กรุณาระบุรหัสเครื่องหมายการค้ารอง" ;
var E5008 = "E:E5008:กรุณาระบุชื่อเครื่องหมายการค้ารอง" ;
var E5009 = "E:E5009:กรุณาระบุอัตราภาษีตามมูลค่าหรืออัตราภาษีตามปริมาณ" ;
var E5010 = "E:E5010:กรุณาระบุปริมาณที่ใช้เป็นฐานในการเก็บภาษี" ;
var E5011 = "E:E5011:กรุณาระบุรหัสหน่วยสินค้า" ;
var E5012 = "E:E5012:กรุณาระบุชื่อหน่วยสินค้า" ;
var E5013 = "E:E5013:กรุณาระบุรหัสแบบ/รุ่น" ;
var E5014 = "E:E5014:กรุณาระบุรายละเอียดแบบ/รุ่น" ; 
var E5015 = "E:E5015:กรุณาระบุรหัสประเภทสินค้าย่อย" ;
var E5016 = "E:E5016:กรุณาระบุรายละเอียดประเภทสินค้าย่อย" ;
var E5017 = "E:E5017:กรุณาระบุชื่อสินค้า" ;
var E5018 = "E:E5018:กรุณาระบุเลือกกลุ่มสินค้า" ;
var E5019 = "E:E5019:กรุณาระบุขนาดหลุม" ;
var E5020 = "E:E5020:กรุณาระบุรายละเอียดบริการ" ;
var E5021 = "E:E5021:กรุณาระบุแรงแอลกอฮอล์" ;
var E5022 = "E:E5022:กรุณาระบุภาชนะบรรจุ" ;
var E5023 = "E:E5023:กรุณาระบุขนาดภาชนะบรรจุ" ;
var E5024 = "E:E5024:กรุณาระบุขนาดบรรจุ" ;
var E5025 = "E:E5025:กรุณาระบุวันที่ในการสำรวจ" ;
var E5026 = "E:E5026:กรุณาระบุครั้งที่ในการสำรวจ" ;
var E5027 = "E:E5027:กรุณาระบุเลขที่ทะเบียนรับ";
var E5028 = "E:E5028:กรุณาระบุประเทศส่งออก";
var E5029 = "E:E5029:กรุณาระบุราคา ณ โรงอุตสาหกรรม(ต้องมากกว่า 0.00)";
var E5030 = "E:E5030:ผลรวมของต้นทุนวัตถุดิบและค่าใช้จ่ายในการผลิต ต้องมากว่า 0.00";
var E5031 = "E:E5031:กรุณาระบุกำไร(ต้องมากว่า 0.00)";
var E5032 = "E:E5032:ราคาขาย ณ โรงงานอุตสาหกรรมไม่เท่ากับราคาขาย ณ โรงงานที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5033 = "E:E5033:ราคาขาย ณ โรงงานอุตสาหกรรมน้อยกว่าราคาขาย ณ โรงงานที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5034 = "E:E5034:ราคาขาย ณ โรงงานอุตสาหกรรมมากกว่าราคาขาย ณ โรงงานที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5035 = "E:E5035:กรุณาระบุวันที่เริ่มใช้" ;
var E5036 = "E:E5036:ผลรวมของต้นทุนวัตถุดิบ หรือต้นทุนน้ำสุรา ต้องมากว่า 0.00";
var E5037 = "E:E5037:กรุณาระบุแรงงานทางตรง ต้องมากว่า 0.00";
var E5038 = "E:E5038:กรุณาระบุค่าใช้จ่ายในการผลิต ต้องมากว่า 0.00";
var E5039 = "E:E5039:ราคา ณ โรงงานสุราต่อหน่วยไม่เท่ากับราคาขาย ณ โรงงานสุราที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5040 = "E:E5040:ราคา ณ โรงงานสุราต่อหน่วยน้อยกว่าราคาขาย ณ โรงงานสุราที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5041 = "E:E5041:ราคา ณ โรงงานสุราต่อหน่วยมากกว่าราคาขาย ณ โรงงานสุราที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5042 = "E:E5042:กรุณาระบุผู้อนุมัติ" ;
var E5043 = "E:E5043:กรุณาระบุรายการ" ;
var E5044 = "E:E5044:ผลรวมของค่าวัตถุทางตรง ต้องมากว่า 0.00" ;
var E5045 = "E:E5045:กรุณาระบุภาษี อบจ. ต้องมากว่า 0.00" ;
var E5046 = "E:E5046:กรุณาระบุภาษีมูลค่าเพิ่ม ต้องมากว่า 0.00" ;
var E5047 = "E:E5047:ราคา ณ โรงงานยาสูบต่อหน่วยไม่เท่ากับราคาขาย ณ โรงงานยาสูบที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5048 = "E:E5048:ราคา ณ โรงงานยาสูบต่อหน่วยน้อยกว่าราคาขาย ณ โรงงานยาสูบที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5049 = "E:E5049:ราคา ณ โรงงานยาสูบต่อหน่วยมากกว่าราคาขาย ณ โรงงานยาสูบที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5050 = "E:E5050:วันที่ยืนแบบน้อยกว่าวันที่เริ่มจำหน่ายสินค้า";
var E5051 = "E:E5051:กรุณาระบุชื่อเครื่องหมายการค้า" ;
var E5052 = "E:E5052:กรุณาระบุชื่อบริษัท" ;
var E5053 = "E:E5053:กรุณาระบุลักษณะซอง" ;
var E5054 = "E:E5054:กรุณาระบุราคา CIF" ;
var E5055 = "E:E5055:กรุณาระบุราคาขายปลีก" ;
var E5056 = "E:E5056:ค่าการตลาด ต้องมากว่า 0.00" ;
var E5057 = "E:E5057:กรุณาระบุราคาค่าบริการ (ต้องมากกว่า 0.00)"; 
var E5058 = "E:E5058:ชื่อวัตถุดิบซ้ำ"; 
var E5059 = "E:E5059:ทะเบียนรับแบบซ้ำ"; 

var E5901 = "E:E5901:รหัสกลุ่มสินค้าต้องเป็นตัวเลขเท่านั้น" ;
var E5902 = "E:E5902:รหัสประเภทสินค้า/บริการต้องเป็นตัวเลขเท่านั้น" ;
var E5903 = "E:E5903:รหัสเครื่องหมายการค้าหลักต้องเป็นตัวเลขเท่านั้น" ;
var E5904 = "E:E5904:รหัสเครื่องหมายการค้ารองต้องเป็นตัวเลขเท่านั้น" ;
var E5999 = "E:E5999:";
  
var E6001 = "E:E6001:รหัสซ้ำ";
var E6002 = "E:E6002:กรุณาระบุสถานะรายการ";
var E6003 = "E:E6003:กรุณาระบุรายการที่ต้องการลบ";
var E6004 = "E:E6004:ใบอนุญาตที่ออกเลขที่ใบอนุญาตแล้วไม่สามารถแก้ไขได้";
var E6005 = "E:E6005:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถเพิกถอนได้";
var E6006 = "E:E6006:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถยกเลิกได้";
var E6007 = "E:E6007:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถออกใบแทนได้";
var E6008 = "E:E6008:ใบอนุญาตที่ออกเลขที่ใบอนุญาตแล้วไม่สามารถออกเลขที่ซ้ำ";
var E6009 = "E:E6009:ที่อยู่ของผู้ประกอบการรายนี้ตั้งอยู่ในบริเวณสถานที่ห้ามขาย";   
var E6010 = "E:E6010:จำนวนต้องมากกว่าศูนย์";     
var E6011 = "E:E6011:ไม่พบเลขที่ใบอนุญาตในฐานข้อมูล";        
var E6012 = "E:E6012:วันที่เริ่มต้นต้องไม่เกินวันที่สิ้นสุด"; 
var E6013 = "E:E6013:บันทึกเลขที่หนังสืออนุญาตแล้วไม่สามารถแก้ไขได้";            
var E6014 = "E:E6014:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถพิมพ์ได้";     
var E6015 = "E:E6015:กรุณาบันทึก";          
var E6016 = "E:E6016:เลขที่ใบอนุญาตต้องน้อยกว่าเลขที่ปัจจุบัน";  
var E6017 = "E:E6017:เลขที่ใบอนุญาตซ้ำ";        
var E6018 = "E:E6018:จำนวนต้องไม่เกิน";      
var E6019 = "E:E6019:กรุณาระบุจำนวนให้ครบ";   
var E6020 = "E:E6020:ความยาวต้องไม่เกิน";       
var E6021 = "E:E6021:การขออนุญาตที่ยังไม่ออกเลขที่หนังสืออนุญาตไม่สามารถพิมพ์ได้";  
var E6022 = "E:E6022:พิมพ์ใบอนุญาตได้ครั้งละ 1 รายการ";  
var E6023 = "E:E6023:ไม่พบรหัสจังหวัดของหน่วยงานสรรพสามิต";  
var E6024 = "E:E6024:วันที่ส่งเงินต้องอยู่ระหว่างวันที่ออกใบอนุญาต"; 
var E6025 = "E:E6025:ที่อยู่สถานประกอบการไม่อยู่ในพื้นที่รับผิดชอบ"; 
var E6026 = "E:E6026:นำเข้าข้อมูลเข้าสู่ระบบรายได้แล้วไม่สามารถยกเลิกการนำส่งเงินรายได้";
var E6027 = "E:E6027:ใบอนุญาตที่ออกเลขที่ใบอนุญาตแล้วไม่สามารถลบได้";
var E6028 = "E:E6028:ไม่สามารถต่ออายุใบอนุญาตจำหน่ายสุรา ป.5 และ ป.6 ได้";  
        E6028 += "\n             ให้ทำการขอใบอนุญาตใหม่ทุกครั้งที่หมดอายุ";
var E6029 = "E:E6029:ใบอนุญาตที่นำส่งข้อมูลรายได้แล้วไม่สามารถแก้ไขได้";
var E6030= "E:E6030:ไม่สามารถแก้ไขสถานประกอบการที่สร้างจากระบบอื่นได้";  
var E6031= "E:E6031:ไม่พบเลขที่ใบอนุญาตในฐานข้อมูล NSW";
var E6032= "E:E6032:รหัสพื้นที่สถานประกอบการ ไม่ตรงกับรหัสสรรพสามิตพื้นที่/พื้นที่สาขา";
    E6032 += "\nไม่สามารถออกใบอนุญาตได้";
           
var E6101 = "E:E6101:กรุณาระบุรหัสหนังสืออนุญาต";
var E6102 = "E:E6102:กรุณาระบุชื่อหนังสืออนุญาต";
var E6103 = "E:E6103:กรุณาระบุรหัสรสชาติ";
var E6104 = "E:E6104:กรุณาระบุชื่อรสชาติ";
var E6105 = "E:E6105:กรุณาระบุรหัสสาเหตุที่ยกเลิก";
var E6106 = "E:E6106:กรุณาระบุสาเหตุที่ยกเลิก";
var E6107 = "E:E6107:กรุณาระบุรหัสหน่วยงาน";
var E6108 = "E:E6108:กรุณาระบุชื่อหน่วยงาน";
var E6109 = "E:E6109:กรุณาระบุประเภทหน่วยงาน";
var E6110 = "E:E6110:กรุณาระบุรหัสพื้นที่";
var E6111 = "E:E6111:กรุณาระบุคำนำหน้าผู้ประกอบการ";
var E6112 = "E:E6112:กรุณาระบุชื่อผู้ประกอบการ";
var E6113 = "E:E6113:กรุณาระบุคำนำหน้าสถานประกอบการ";
var E6114 = "E:E6114:กรุณาระบุชื่อสถานประกอบการ";
var E6115 = "E:E6115:กรุณาระบุเลขที่ตั้ง";
var E6116 = "E:E6116:กรุณาระบุตำบล/แขวง";
var E6117 = "E:E6117:กรุณาระบุอำเภอ/จังหวัด";
var E6118 = "E:E6118:กรุณาระบุรหัสไปรษณีย์";
var E6119 = "E:E6119:กรุณาระบุตำแหน่งที่ตั้ง";
var E6120 = "E:E6120:เล่มที่ใบอนุญาตต้องไม่น้อยกว่าปีปัจจุบัน";   
var E6121 = "E:E6121:วันที่ต้องไม่น้อยกว่าวันที่ขออนุญาต";   
var E6122 = "E:E6122:ชื่อพันธุ์ต้นยาสูบซ้ำ";  
var E6123 = "E:E6123:ปีที่เพาะปลูกต้องไม่น้อยกว่าปีปัจจุบัน";  
var E6124 = "E:E6124:ชื่อพันธุ์ใบยาแห้งซ้ำ"; 
var E6125 = "E:E6125:ชื่อจังหวัดซ้ำ";    
var E6126 = "E:E6126:เล่มที่หนังสือสำคัญซ้ำ";    
var E6127 = "E:E6127:ชื่อไฟล์ไม่ถูกต้อง";    
var E6128 = "E:E6128:ไม่พบชื่อไฟล์ที่ต้องการโหลดข้อมูล";   
var E6129 = "E:E6129:ข้อมูลในไฟล์ไม่ถูกต้อง";
var E6130 = "E:E6130:ชื่อกลุ่มสินค้าซ้ำ";  
var E6131 = "E:E6131:ระบุรายละเอียดได้เฉพาะการขออนุญาตใช้ฉลาก";      
var E6132 = "E:E6132:กรุณาระบุรหัสคำเตือน";
var E6133 = "E:E6133:กรุณาระบุรายละเอียดคำเตือน";
var E6134 = "E:E6134:ไม่สามารถออกใบอนุญาตให้ทำเชื้อสุราได้ เนื่องจากจะต้องขอใบอนุญาตให้ทำสุรามาก่อน";    
var E6135 = "E:E6135:ไม่สามารถออกใบอนุญาตได้ เนื่องจากจะต้องขอใบอนุญาตให้ทำการบ่มหรืออบใบยาก่อน";
var E6136 = "E:E6136:ชื่อเครื่องหมายการค้าหลัก (ไทย) ซ้ำ";
var E6137 = "E:E6137:ชื่อเครื่องหมายการค้าหลัก (อังกฤษ) ซ้ำ";
var E6138 = "E:E6138:ชื่อเครื่องหมายการค้ารอง (ไทย) ซ้ำ";
var E6139 = "E:E6139:ชื่อเครื่องหมายการค้ารอง (อังกฤษ) ซ้ำ";
var E6140 = "E:E6140:เล่มที่ใบอนุญาตต้องไม่มากกว่าปี ";
var E6141 = "E:E6141:ไม่สามารถยกเลิกใบอนุญาตถ้าวันที่ปัจจุบันมากกว่าวันที่ออกใบอนุญาตเกิน 2 วัน";
var E6142 = "E:E6142:Version ของไฟล์นำข้อมูลเข้าไม่ถูกต้อง";
var E6143 = "E:E6143:วันที่ออกใบอนุญาตไม่ถูกต้อง";
var E6144 = "E:E6144:รหัสผู้ทำรายการไม่ถูกต้อง";
var E6145 = "E:E6145:ข้อมูลควบคุมไม่ถูกต้อง";
var E6146 = "E:E6146:รหัสสำนักงานสรรพสามิตไม่ถูกต้อง";
var E6147 = "E:E6147:มีข้อมูลเลขประจำตัวประชาชนในฐานข้อมูลแล้ว กรุณาตรวจสอบ";
var E6148 = "E:E6148:รหัสผู้ใช้งานนี้มีอยู่แล้วในสำนักสรรพสามิตพื้นที่นี้";
var E6149 = "E:E6149:หมายเลขเครื่องนี้มีอยู่แล้วในสำนักสรรพสามิตพื้นที่นี้";
var E6150 = "E:E6150:ไม่พบรหัสผู้ใช้งานในสำนักงานสรรพสามิตพื้นที่นี้";
var E6151 = "E:E6151:รหัสผู้ใช้งานไม่ตรงกับรหัสที่ Login เข้าระบบ";
var E6152 = "E:E6152:ไม่พบข้อมูลลงทะเบียนใช้งานระบบใบอนุญาต Offline";
var E6153 = "E:E6153:ไม่พบข้อมูลรหัสอนุมัติให้ใช้งานระบบใบอนุญาต Offline";
var E6154 = "E:E6154:วันที่จ่ายแสตมป์ซ้ำกับในฐานข้อมูล";
var E6155 = "E:E6155:ไม่พบข้อมูลใบอนุญาตในไฟล์ที่อัพโหลด";
var E6156 = "E:E6156:รหัสผู้ใช้งาน หรือ รหัสผ่านไม่ถูกต้อง";
       
var E7001 = "E:E7001:วันที่ ต้องไม่มากกว่า วันปัจจุบัน";
var E7002 = "E:E7002:วันที่รับ ตั้งแต่ ต้องไม่มากกว่า วันที่รับ ถึง";
var E7003 = "E:E7003:ไม่สามารถเลือกรายการ ที่รหัสรายได้ต่างกัน";
var E7004 = "E:E7004:กรุณาเลือกรายการสินค้า";
var E7005 = "E:E7005:จำนวนเงินเครดิตภาษี ต้องไม่มากกว่า จำนวนเงินอนุมัติคงเหลือ";
var E7006 = "E:E7006:บันทึกได้เฉพาะตัวเลข และจุดทศนิยม 2 หลักเท่านั้น";
var E7007 = "E:E7007:เลขที่คุมเอกสารต้องมีขนาด 15 หลัก";
var E7008 = "E:E7008:รหัสรายได้ต้องมีขนาด 6 หลัก";
var E7009 = "E:E7009:รหัสศูนย์ต้นทุนเจ้าของรายได้ ต้องบันทึกเป็นตัวเลข 10 หลัก";
var E7010 = "E:E7010:รหัสบัญชีย่อย ต้องบันทึกเป็นตัวเลข 5 หลัก";
var E7011 = "E:E7011:วันที่ ตั้งแต่ ต้องไม่มากกว่า วันที่ ถึง";
var E7012 = "E:E7012:วันที่หนังสือค้ำประกัน ต้องไม่มากกว่า วันที่ของสัญญา";
var E7013 = "E:E7013:วันที่ของสัญญา ต้องอยู่ในช่วง วันที่อนุญาต วันที่สิ้นสุด ของใบอนุญาต";
var E7014 = "E:E7014:จำนวนเงินของสัญญา ไม่เท่ากับ จำนวนเงินของหนังสือค้ำประกัน";
var E7015 = "E:E7015:วันที่ขยายเวลา ต้องมากกว่า วันที่สิ้นสุดของสัญญา";
var E7016 = "E:E7016:วันที่เปลี่ยนหนังสือค้ำประกัน ต้องมากกว่า วันที่ของสัญญา";
var E7017 = "E:E7017:วันที่หนังสือค้ำประกัน ต้องไม่มากกว่า วันที่เปลี่ยนหนังหนังสือค้ำประกัน";
var E7018 = "E:E7018:รหัสแสตมป์ด้านซ้ายหลักที่ 1-2 ต้องมีขนาด 2 หลัก";
var E7019 = "E:E7019:รหัสแสตมป์ด้านซ้ายหลักที่ 3-6 ต้องมีขนาด 4 หลัก";
var E7020 = "E:E7020:รหัสแสตมป์ด้านขวาหลักที่ 1-2 ต้องมีขนาด 2 หลัก";
var E7021 = "E:E7021:รหัสแสตมป์ด้านขวาหลักที่ 3-6 ต้องมีขนาด 2 หลัก";
var E7022 = "E:E7022:จำนวนนำเข้า ต้องไม่มากกว่า จำนวนคงเหลือ";
var E7023 = "E:E7023:วันที่นำเข้า ต้องไม่มากกว่า นำเข้าได้ถึงวันที่";
var E7024 = "E:E7024:จำนวนแสตมป์(ดวง) ไม่เท่ากับ จำนวนยาสูบที่ชำระภาษี";
var E7025 = "E:E7025:ไม่พบ Mapping รหัสสินค้า กับ รหัสรายได้";
var E7026 = "E:E7026:จำนวนที่เปลี่ยนแปลง ต้องไม่น้อยกว่า จำนวนที่นำเข้าแล้ว";
var E7027 = "E:E7027:วันที่ทำรายการ ต้องไม่มากกว่า วันที่หมดอายุการนำเข้า";
var E7028 = "E:E7028:จำนวนที่ขออนุญาต ต้องเท่ากับ จำนวนที่ขอเปลี่ยนแปลง";
var E7029 = "E:E7029:วันที่ของสัญญา ต้องไม่มากกว่า วันที่ทำรายการ";
var E7030 = "E:E7030:ชำระทุกวันที่ ต้องอยู่ในช่วงวันที่ 1 ถึง 31";
var E7031 = "E:E7031:กรุณาสร้างตารางชำระ";
var E7032 = "E:E7032:วันที่อนุมัติ ต้องไม่มากกว่า วันที่สิ้นสุด";
var E7033 = "E:E7033:จำนวนเงินภาษีสรรพสามิตที่ชำระ น้อยกว่า จำนวนเงินคืนภาษี";
var E7034 = "E:E7034:จำนวนเงินภาษีเพื่อมหาดไทยที่ชำระ น้อยกว่า จำนวนเงินคืนภาษี";
var E7035 = "E:E7035:จำนวนเงินนำส่งกองทุน สสส. น้อยกว่า จำนวนเงินคืนภาษี";
var E7036 = "E:E7036:เลขที่ใบเสร็จรับเงินต้องมีขนาด 15 หลัก";
var E7037 = "E:E7037:ปี ต้องบันทึกเป็นตัวเลข 4 หลัก";
var E7038 = "E:E7038:ผู้ประกอบการ และรหัสรายได้ ต้องเหมือนกัน";
var E7039 = "E:E7039:เลขที่วิเคราะห์ต้องมีขนาด 15 หลัก";
var E7040 = "E:E7040:รายการนี้ชำระแล้ว ไม่สามารถเลือกได้";
var E7041 = "E:E7041:ไม่พบเลขทะเบียนสรรพสามิตที่ระบุ";
var E7042 = "E:E7042:เลขที่เช็คต้องมีขนาด 7 หรือ 8 หลัก";
var E7043 = "E:E7043:วันที่เช็คน้อยกว่าวันที่ปัจจุบันได้ไม่เกิน 7 วัน";
var E7044 = "E:E7044:รวมจำนวนเงินที่ชำระ ต้องมากกว่าหรือเท่ากับ รวมภาษีที่ต้องชำระ";
var E7045 = "E:E7045:จำนวนเงิน หักคืนภาษี มากกว่า ภาษีสรรพสามิตที่ชำระ";
var E7046 = "E:E7046:จำนวนเงิน หักคืนภาษี ไม่เท่ากับ จำนวนเงินเครดิตภาษี";
var E7047 = "E:E7047:จำนวนเงินเช็คขัดข้อง ไม่เท่ากับ จำนวนเงินที่ชำระ";
var E7048 = "E:E7048:รายการนี้ยังไม่ปิดสิ้นวัน ไม่สามารถทำรายการปรับปรุงได้";
var E7049 = "E:E7049:ไม่สามารถเลือกรหัสรายได้นี้ เนื่องจากไม่มีการเก็บภาษีมหาดไทย แต่รายการชำระมีการเก็บภาษีมหาดไทย";
var E7050 = "E:E7050:ไม่สามารถเลือกรหัสรายได้นี้ เนื่องจากรหัสแบบไม่ตรงกัน";
var E7051 = "E:E7051:รายการนี้ข้อมูลมาจากระบบงานอื่น ไม่สามารถทำรายการปรับปรุงได้";
var E7052 = "E:E7052:มีการบันทึกข้อมูลใบขนนี้แล้ว";
var E7053 = "E:E7053:รหัสสินค้า EDI ต้องมีขนาด 8 หลัก";
var E7054 = "E:E7054:ไม่พบข้อมูล Mapping รหัสประเทศ ของกรมศุลกากร กับกรมสรรพสามิต";
var E7055 = "E:E7055:ไม่พบข้อมูล Mapping รหัสหน่วยสินค้า ของกรมศุลกากร กับกรมสรรพสามิต";
var E7056 = "E:E7056:เลขที่ใบนำส่งต้องมีขนาด 16 หลัก";
var E7057 = "E:E7057:รายการนี้ปิดสิ้นวันแล้ว ไม่สามารถแก้ไขได้";
var E7058 = "E:E7058:รายการนี้บันทึกบัญชีแล้ว ไม่สามารถแก้ไขได้";
var E7059 = "E:E7059:ไม่พบรายการที่ยังไม่ได้พิมพ์ใบเสร็จรับเงิน";
var E7060 = "E:E7060:ไม่พบรายการพิมพ์บนแบบ (ยังไม่ได้พิมพ์ใบเสร็จรับเงิน)";
var E7061 = "E:E7061:ยังไม่ได้บันทึกบัญชีด้านรับเงินรายได้ ไม่สามารถบันทึกบัญชีด้านนำส่งเงิน";
var E7062 = "E:E7062:ยังไม่ได้ออกเลขที่ใบนำส่งเงิน ไม่สามารถบันทึกบัญชีด้านนำส่งเงิน";
var E7063 = "E:E7063:พบรายการใบเสร็จรับเงิน ที่มีการพิมพ์แล้ว";
var E7064 = "E:E7064:ไม่พบข้อมูลการปิดสิ้นวัน";
var E7065 = "E:E7065:จำนวนเงินค่าผลประโยชน์ไพ่ ไม่เท่ากับ ผลรวมจำนวนเงินงวด";
var E7066 = "E:E7066:วันที่ออกบัตรภาษี ต้องไม่มากกว่า วันที่หมดอายุบัตรภาษี";
var E7067 = "E:E7067:วันที่ออกบัตรภาษี ต้องไม่มากกว่า วันที่จัดเก็บรายได้";
var E7068 = "E:E7068:เลขที่บัตรภาษี หรือ มูลค่าบัตรภาษี ไม่ถูกต้อง";
var E7069 = "E:E7069:เลขที่บัตรภาษีที่ออกก่อน 1 มิย. 2541 ต้องมีขนาด 7 หลัก";
var E7070 = "E:E7070:เลขที่บัตรภาษีที่ออกตั้งแต่ 1 มิย. 2541 ต้องมีขนาด 9 หลัก และขึ้นต้องด้วยอักษร 02 หรือ 11 เท่านั้น";
var E7071 = "E:E7071:จำนวนเงินมูลค่าบัตรภาษี มากกว่า จำนวนเงินจากจอรับชำระ";
var E7072 = "E:E7072:ไม่พบใบอนุญาต/ใบอนุญาตหมดอายุ (ส.1/72) ไม่สามารถทำรายการได้";
var E7073 = "E:E7073:ยังไม่ได้บันทึกรายการสินค้าในระบบวิเคราะห์";
var E7074 = "E:E7074:ไม่พบรายการสุราที่ชำระภาษี";
var E7075 = "E:E7075:กรุณาเลือกรายการใบเสร็จรับเงิน";
var E7076 = "E:E7076:ปริมาณที่เสียภาษี หักปริมาณที่ถ่ายถังแล้ว น้อยกว่า ปริมาณที่ถ่ายถังครั้งนี้";
var E7077 = "E:E7077:ปริมาณน้ำเบียร์ที่ขอถ่ายถัง มากกว่า ปริมาณน้ำเบียร์ที่ได้รับอนุมัติ ต่อ เดือน";
var E7078 = "E:E7078:วันที่ ต้องไม่น้อยกว่าวันปัจจุบัน";
var E7079 = "E:E7079:ปริมาณน้ำสุรา ไม่เท่ากับ ปริมาณที่ถ่ายถังครั้งนี้";
var E7080 = "E:E7080:กรุณาเลือก Excel file เท่านั้น";
var E7081 = "E:E7081:กรุณาบันทึกรายการ Printer ที่ใช้สำหรับพิมพ์ใบเสร็จรับเงิน / พิมพ์บนแบบ";
var E7082 = "E:E7082:ไม่พบใบอนุญาต/ใบอนุญาตหมดอายุ (ย.ส.207) ไม่สามารถทำรายการได้";
var E7083 = "E:E7083:เดือนภาษี ไม่ตรงกับเดือนของ ตั้งแต่วันที่ ถึงวันที่ ที่นำออกจากโรงอุตฯ";
var E7084 = "E:E7084:เดือน ตั้งแต่ ต้องไม่มากกว่า เดือน ถึง";
var E7085 = "E:E7085:ไม่พบใบอนุญาต/ใบอนุญาตหมดอายุ (ส.1/66) ไม่สามารถทำรายการได้";
var E7086 = "E:E7086:มีรายการของเครื่องขายเครื่องดื่ม ที่ยังบันทึกสินค้าไม่ครบ";
var E7087 = "E:E7087:ไม่สามารถปรับปรุงรายการที่รับชำระภายในวันนี้ได้";
var E7088 = "E:E7088:ยังไม่ได้มีการออกใบเสร็จรับเงิน ไม่สามารถทำรายการได้";
var E7089 = "E:E7089:เดือน ต้องไม่มากกว่า เดือนปัจจุบัน";
var E7090 = "E:E7090:เลยเวลาปิดสิ้นวัน";
var E7091 = "E:E7091:กรุณาเลือกรายการที่จะนำเข้าระบบรายได้";
var E7092 = "E:E7092:กรุณากดปุ่ม [ตกลง]";
var E7093 = "E:E7093:ไม่สามารถเลือกผู้ประกอบการที่ต่างกันได้";
var E7094 = "E:E7094:เลขที่บัตรภาษีนี้มีการนำไปใช้แล้ว ที่เลขคุมเอกสาร ";
var E7095 = "E:E7095:เลขที่ใบเสร็จ เล่มที่/เลขที่นี้มีการนำไปใช้แล้ว ";
var E7096 = "E:E7096:พบรายการข้อมูลที่ยังไม่ได้ปิดบัญชี ";
var E7097 = "E:E7097:ไม่สามารถยกเลิกการประมวลผลได้ เนื่องจากนำข้อมูลส่ง GF แล้ว";
var E7098 = "E:E7098:วันที่หมดอายุบัตรภาษี ต้องไม่มากกว่า วันที่จัดเก็บรายได้";
var E7099 = "E:E7099:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากวันที่นำฝากมากกว่าวันที่ปัจจุบัน";
var E7100 = "E:E7100:ไม่สามารถประมวลผลได้ เนื่องจากสถานะเปลี่ยนแปลงไปแล้ว";
var E7101 = "E:E7101:เลขที่อ้างอิงเมื่อนำเงินฝากคลัง ต้องมีขนาด 16 หลัก";
var E7102 = "E:E7102:เลขที่อ้างอิงเมื่อนำเงินฝากบัญชี อบจ. ต้องมีขนาด 16 หลัก";
var E7103 = "E:E7103:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากเลขที่อ้างอิงพักหน่วยงานซ้ำ";
var E7104 = "E:E7104:วันที่นำเงินฝากคลัง ต้องไม่น้อยกว่าวันที่ประมวลผลนำเงินฝากคลัง";
var E7105 = "E:E7105:วันที่คืนเช็คขัดข้อง ต้องไม่น้อยกว่าวันที่รับรู้เช็คขัดข้อง";
var E7106 = "E:E7106:วันที่นำฝาก ต้องไม่น้อยกว่าวันที่จัดเก็บ";
var E7107 = "E:E7107:วันที่เรียกเก็บจากธนาคาร ต้องไม่น้อยกว่าวันที่นำฝากบัญชีพักหน่วยงาน";
var E7108 = "E:E7108:กรุณาติดต่อเจ้าหน้าที่ผู้ดูแลระบบงานรายได้เพื่อเพิ่มข้อมูลบัญชีองค์การบริหารส่วนจังหวัด\nเนื่องจากหน่วยงานของท่านยังไม่มีชื่อบัญชี หรือ เลขที่บัญชีองค์การบริหารส่วนจังหวัด ในระบบ";
var E7109 = "E:E7109:วันที่นำฝากต้องมากกว่าหรือเท่ากับวันที่ปัจจุบัน";
var E7110 = "E:E7110:เงื่อนไขตามวันที่จัดเก็บไม่มีรายการที่ต้องนำฝากเข้าบัญชีพักหน่วยงาน";
var E7111 = "E:E7111:ไม่สามารถประมวลผลได้ เนื่องจากมีใบนำฝากที่ยังไม่ยืนยันเลขที่อ้างอิงพักหน่วยงาน";
var E7112 = "E:E7112:ไม่สามารถประมวลผลได้ เนื่องจากยังไม่ยืนยันประมวลผลจัดเก็บรายได้ให้ภาค";
var E7113 = "E:E7113:กรุณาเลือกรายการที่จะพิมพ์ใบเสร็จรับเงิน";
var E7114 = "E:E7114:ไม่สามารถประมวลผลนำเงินฝากคลังได้";
var E7115 = "E:E7115:กรุณาติดต่อเจ้าหน้าที่ผู้ดูแลระบบงานรายได้เพื่อเพิ่มข้อมูลรหัสศูนย์ต้นทุน\nเนื่องจากหน่วยงานของท่านยังไม่ได้บันทึกรหัสศูนย์ต้นทุน ในระบบ";
var E7116 = "E:E7116:กรุณาระบุเลขที่อ้างอิงของรายการภาษี โดยการคลิกเลือกปุ่ม help เพื่อเลือกเลขที่ใบเสร็จรับเงิน";
var E7117 = "E:E7117:ไม่สามารถบันทึกเลขที่อ้างอิงนำฝากคลังได้";
var E7118 = "E:E7118:กรุณาระบุจำนวนใบ/ราย และตรวจสอบว่าถูกต้องหรือไม่";
var E7119 = "E:E7119:กรุณาติดต่อเจ้าหน้าที่ผู้ดูแลระบบงานรายได้เพื่อเพิ่มข้อมูลรหัสหน่วยงานที่ใช้ Export บัตรภาษีให้กรมศุลกากร";
var E7120 = "E:E7120:กรุณาบันทึก หักคืนภาษี";
var E7121 = "E:E7121:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากปิดสิ้นวันแล้ว";
var E7122 = "E:E7122:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากหมายเลขเครื่อง / แชสซีย์ซ้ำ";
var E7123 = "E:E7123:ไม่สามารถปรับปรุงเป็นรหัสรายได้ใหม่ได้";
var E7124 = "E:E7124:รูปแบบ Excel file ไม่ถูกต้อง";
var E7125 = "E:E7125:ไม่พบใบอนุญาต/ใบอนุญาตหมดอายุ (ส.1/72) กรุณาตรวจสอบ";
var E7126 = "E:E7126:ไม่พบใบอนุญาต/ใบอนุญาตหมดอายุ (ย.ส.207) กรุณาตรวจสอบ";
var E7127 = "E:E7127:ไม่สามารถทำรายการอนุมัติยกเลิกได้ เนื่องจาก ";
var E7128 = "E:E7128:จำนวนเงิน หักคืนภาษีมหาดไทย ไม่เท่ากับ จำนวนเงินเครดิตภาษีมหาดไทย"; 
var E7129 = "E:E7129:กรณีมีเครดิตภาษี จะไม่สามารถเลือกได้มากกว่า 1 รายการ";
var E7130 = "E:E7130:ไม่สามารถเลือกรายการได้ กรุณาอนุมัติยกเลิกรายการรับชำระก่อน";
var E7131 = "E:E7131:ไม่พบใบอนุญาตนำเข้าในระบบ กรุณาตรวจสอบ";
var E7132 = "E:E7132:จำนวนเงินหักลดหย่อน / หักค่าภาษีสุรา ต้องไม่มากกว่า จำนวนเงินภาษีสรรพสามิต";
var E7133 = "E:E7133:รายการนี้ปิดสิ้นวันแล้ว";
var E7134 = "E:E7134:รายการนี้ยังไม่ได้ปิดสิ้นวัน ไม่สามารถแก้ไขรายละเอียดได้\nต้องให้พื้นที่รับชำระเป็นผู้แก้ไข";
var E7135 = "E:E7135:จำนวนเงินหักคืนภาษี ต้องไม่มากกว่า จำนวนเงินภาษีสรรพสามิต";
var E7136 = "E:E7136:จำนวนเงินหักคืนภาษีมหาดไทย ต้องไม่มากกว่า จำนวนเงินภาษีมหาดไทย";
var E7137 = "E:E7137:ท่านไม่ได้บันทึกหักคืนภาษีสรรพสามิต กรุณาตรวจสอบ";
var E7138 = "E:E7138:ไม่สามารถเลือกวันที่ ที่ปีงบประมาณต่างกันได้";
var E7139 = "E:E7139:ไม่สามารถแก้ไขรายการได้ เนื่องจากมีการรับชำระภาษีแล้วที่ระบบรายได้";
var E7140 = "E:E7140:มีรายการยื่นแบบภาษีผ่านอินเทอร์เน็ตและชำระภาษีที่เคาน์เตอร์เซอร์วิส\nโปรดตรวจสอบและทำการออกใบเสร็จรับเงิน";

var E8001 = "E:E8001:กรุณาเลือกประเภทการขออนุญาต";
var E8002 = "E:E8002:กรุณาระบุจำนวนที่ขออนุมัติ";
var E8003 = "E:E8003:กรุณาระบุจำนวนภาษีที่ขออนุมัติ";
var E8004 = "E:E8004:กรุณาระบุผลการอนุมัติ";
var E8005 = "E:E8005:กรุณาระบุเลขที่อนุญาต กค.";
var E8006 = "E:E8006:กรุณาระบุชื่อผู้อนุมัติ";
var E8007 = "E:E8007:กรุณาระบุวันที่ที่อนุมัติ";
var E8008 = "E:E8008:กรุณาเลือกแบบที่จะขอคืน";
var E8009 = "E:E8009:กรุณาระบุจำนวนที่อนุมัติ";
var E8010 = "E:E8010:กรุณาระบุชื่อยานพาหนะ";
var E8011 = "E:E8011:กรุณาระบุตามเส้นทาง";
var E8012 = "E:E8012:กรุณาระบุภายในวันที่";
var E8013 = "E:E8013:กรุณาระบุวันที่ส่งออกจริง";
var E8014 = "E:E8014:กรุณาระบุวันที่เก็บเข้าคลังสินค้าทัณฑ์บน/โรงอุตสาหกรรม";
var E8015 = "E:E8015:กรุณาระบุจำนวนสินค้าที่รับจริง";
var E8016 = "E:E8016:กรุณาเลือกรายการสินค้า";
var E8017 = "E:E8017:กรุณาเลือกรายการใบเสร็จรับเงิน";
var E8018 = "E:E8018:กรุณาระบุจำนวนเงินที่จะขอคืน";
var E8019 = "E:E8019:กรุณาระบุตรายี่ห้อ";
var E8020 = "E:E8020:กรุณาระบุภาชนะบรรจุ";
var E8021 = "E:E8021:กรุณาระบุขนาด";
var E8022 = "E:E8022:กรุณาระบุแหล่งผลิต";
var E8023 = "E:E8023:กรุณาระบุส่วนราชการ/โรงพยาบาล/องค์การสาธารณกุศล";
var E8024 = "E:E8024:กรุณาระบุจำนวนเตียงคนไข้";
var E8025 = "E:E8025:กรุณาระบุจำนวนรถพยาบาลที่มีอยู่";
var E8026 = "E:E8026:กรุณาระบุหมายเลขเครื่องยนต์";
var E8027 = "E:E8027:กรุณาระบุหมายเลขแชสซีย์";
var E8028 = "E:E8028:กรุณาระบุความจุกระบอกสูบ";
var E8029 = "E:E8029:กรุณาระบุความกว้าง/ยาว";
var E8030 = "E:E8030:ผู้ประกอบการที่ระบุไม่สามารถเลือก 28/1 ได้";
var E8031 = "E:E8031:เลือกได้เฉพาะรายการสินค้าตาม พรบ.2527";
var E8032 = "E:E8032:เลือกได้เฉพาะรายการสินค้าน้ำมันและผลิตภัณฑ์น้ำมัน";
var E8034 = "E:E8034:จำนวนที่อนุมัติต้องน้อยกว่าหรือเท่ากับจำนวนที่ขอ";
var E8035 = "E:E8035:วันเดือนปีของหนังสือบริษัท ต้องมีค่าน้อยกว่าวันเดือนปีของเลขที่ทะเบียนรับ";
var E8036 = "E:E8036:วันเดือนปีของเลขที่ทะเบียนรับ ต้องมีค่าน้อยกว่าวันเดือนปีที่อนุมัติ";
var E8037 = "E:E8037:จำนวนที่ส่งต้องน้อยกว่าหรือเท่ากับจำนวนที่อนุมัติ";
var E8038 = "E:E8038:ไม่สามารถเลือกผู้ประกอบการที่ไม่มีเลขทะเบียนสรรพสามิต หรือ สถานบริการได้";
var E8039 = "E:E8039:วันที่ขอคืน/ยกเว้นภาษีเกิน 60 วัน ต้องทำการขยายเวลา";
var E8040 = "E:E8040:วันที่ขอยกเว้นภาษีเกิน 60 วัน ต้องทำการขยายเวลา";
var E8041 = "E:E8041:จำนวนที่อ้างถึงต้องน้อยกว่าหรือเท่ากับจำนวนที่อ้างถึงแล้ว";
var E8042 = "E:E8042:กรุณาเลือกรายการสินค้าที่ไม่ใช่รายการสินค้าสุรา";
var E8043 = "E:E8043:วันที่เริ่มทำการขยายเวลาต้องมีค่ามากกว่าวันที่ที่เคยบันทึกไปแล้ว";
var E8044 = "E:E8044:เลขที่อนุญาต กค. และวันที่อนุมัติ ต้องไม่ซ้ำกับที่มีในระบบ\nกรุณาระบุข้อมูลใหม่";
var E8045 = "E:E8045:เลือกรายการสินค้าได้เพียงรายการแรกรายการเดียวเท่านั้น";
var E8046 = "E:E8046:วันที่ขอคืนภาษีเกิน 60 วัน ต้องทำการขยายเวลา";
var E8047 = "E:E8047:เลขที่อนุญาต กค. ต้องขึ้นต้นด้วยตัวเลขเท่านั้น และห้ามมีช่องว่างระหว่างตัวอักษร";
var E8048 = "E:E8048:ลำดับที่ใบ Invoice ห้ามซ้ำกัน";
var E8049 = "E:E8049:กรุณากรอกข้อมูลใบเสร็จให้ครบ ก่อนเพิ่มรายการใหม่";
var E8050 = "E:E8050:ทำการขยายเวลาได้ไม่เกิน";
var E8051 = "E:E8051:เลขที่ทะเบียนรับ และวันที่รับ ต้องไม่ซ้ำกับที่มีในระบบ\nกรุณาระบุข้อมูลใหม่";
var E8052 = "E:E8052:เลขที่คุมเอกสาร ต้องไม่ซ้ำกับที่มีในระบบ\nกรุณาระบุข้อมูลใหม่";
var E8053 = "E:E8053:เลขที่เอกสาร (ตามใบกำกับสินค้า) ต้องไม่ซ้ำกับที่มีในระบบ\nกรุณาระบุข้อมูลใหม่";
var E8054 = "E:E8054:เลขที่หนังสือส่ง กค. และวันที่ส่ง ต้องไม่ซ้ำกับที่มีในระบบ \n กรุณาระบุข้อมูลใหม่";
var E8055 = "E:E8055:เลขที่อนุญาต กค. และวันที่ส่ง ต้องไม่ซ้ำกับที่มีในระบบ \n กรุณาระบุข้อมูลใหม่";

var E9001 = "E:E9001:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากมีรายการแม่พิมพ์/แผ่นฟิล์มนี้ในฐานข้อมูลแล้ว";
var E9002 = "E:E9002:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากมีรายการวัตถุดิบนี้ในฐานข้อมูลแล้ว";
var E9003 = "E:E9003:กรุณาบันทึกข้อมูลอย่างน้อย 1 Tab";
var E9004 = "E:E9004:กรุณาระบุช่วงของวันที่การใช้งานให้ถูกต้อง";
var E9005 = "E:E9005:ไม่พบข้อมูลวัตถุดิบชื่อรายการวัตถุดิบใน excel ในฐานข้อมูล";
var E9006 = "E:E9006:ไม่พบข้อมูลวัตถุดิบชื่อรายการวัตถุดิบใน excel ที่ผูกกับโรงงานฝา";
var E9007 = "E:E9007:ไม่สามารถอัพโหลดข้อมูลได้ เนื่องจาก";

var W0001 = "W:W0001:ต้องการลบข้อมูลหรือไม่" ;
var W0002 = "W:W0002:ต้องการจบการทำงานหรือไม่" ;
var W0003 = "W:W0003:ต้องการบันทึกข้อมูลหรือไม่" ;
var W0004 = "W:W0004:ต้องการล้างข้อมูลหรือไม่" ;
var W0005 = "W:W0005:ต้องการอนุมัติข้อมูลหรือไม่" ;
var W0006 = "W:W0006:ต้องการยกเลิกข้อมูลหรือไม่" ;
var W0007 = "W:W0007:ภาษีที่คำนวนได้กับภาษีที่ชำระจากใบเสร็จไม่ตรงกัน ต้องการบันทึกข้อมูลหรือไม่" ;
var W0008 = "W:W0008:ต้องการส่งข้อมูลหรือไม่" ;

var W4001 = "W:W4001:วันที่เริ่มประกอบการ จะต้องน้อยกว่าหรือเท่ากับวันที่ยื่นแบบ";
var W4002 = "W:W4002:วันที่จดทะเบียนใหม่เกินระยะเวลาที่กฏหมายกำหนด";
var W4003 = "W:W4003:กรุณาเลือกพิมพ์สำเนา"; // ให้ต่อด้วย ภษ.01-06 หรือ ภษ.01-07 หรือ อื่นๆ
var W4004 = "W:W4004:พิมพ์ใบทะเบียน ภษ.02-04"; 
var W4005 = "W:W4005:กรุณาเลือกพิมพ์ใบอนุญาต"; // ให้ต่อด้วย ภษ.02-05 หรือ 02-05 ก
var W4006 = "W:W4006:มีการพิมพ์ใบทะเบียน ภษ.02-04 เรียบร้อยแล้ว ต้องการพิมพ์ซ้ำหรือไม่"; 
var W4007 = "W:W4007:มีการพิมพ์ใบอนุญาต ภษ.02-05 เรียบร้อยแล้ว ต้องการพิมพ์ซ้ำหรือไม่"; 
var W4008 = "W:W4008:มีการพิมพ์ใบอนุญาต ภษ.02-05ก เรียบร้อยแล้ว ต้องการพิมพ์ซ้ำหรือไม่"; 
var W4009 = "W:W4009:มีการพิมพ์ใบทะเบียน ภษ.02-04 เรียบร้อยแล้ว ต้องการแก้ไขข้อมูลใหม่หรือไม่";
var W4010 = "W:W4010:มีการพิมพ์ใบอนุญาต ภษ.02-05 เรียบร้อยแล้ว ต้องการแก้ไขข้อมูลใหม่หรือไม่";
var W4011 = "W:W4011:มีการพิมพ์สัญญาคลังสินค้าทัณฑ์บน เรียบร้อยแล้ว  ต้องการพิมพ์ซ้ำหรือไม่";  
var W4012 = "W:W4012:ถ้าไม่มีเอกสารแนบให้ระบุ 0 เท่านั้น";  
var W4013 = "W:W4013:มีการพิมพ์ใบอนุญาต ภษ.02-05ก เรียบร้อยแล้ว ต้องการแก้ไขข้อมูลใหม่หรือไม่";
var W4014 = "W:W4014:ยังไม่ได้ระบุกลุ่มบริษัท ต้องการระบุกลุ่มบริษัทหรือไม่";
var W4015 = "W:W4015:ยังไม่ได้ระบุรายละเอียดสินค้า ต้องการระบุรายละเอียดสินค้าหรือไม่";
var W4016 = "W:W4016:มีการพิมพ์สัญญาคลังสินค้าทัณฑ์บน เรียบร้อยแล้ว ต้องการพิมพ์ซ้ำหรือไม่";
var W4017 = "W:W4017:ต้องการยกเลิกรายการ";
var W4018 = "W:W4018:มีข้อมูลชื่อสถานประกอบการอยู่ในระบบแล้ว ต้องการเพิ่มประเภทสถานประกอบการใหม่หรือไม่";
var W4019 = "W:W4019:มีข้อมูลสถานประกอบการในระบบแล้ว ต้องการบันทึกข้อมูลหรือไม่ \nกด[OK] ถ้าต้องการบันทึก, กด[Cancel] ถ้าต้องการยกเลิกการบันทึก";
var W4020 = "W:W4020:ต้องการยืนยันสถานะการใช้งานหรือไม่";
var W4021 = "W:W4021:ต้องการส่งอนุมัติหรือไม่" ;

var W5001 = "W:W5001:";

var W6001 = "W:W6001:ผู้ประกอบการรายนี้เคยถูกเพิกถอนใบอนุญาต" ;
var W6002 = "W:W6002:ผู้ประกอบการรายนี้เคยเป็นผู้กระทำความผิด" ;
var W6003 = "W:W6003:ผู้ประกอบการรายนี้เคยขอใบอนุญาต" ;
var W6004 = "W:W6004:ให้พิจารณาว่าสถานที่ขายสุราเป็นบริเวณใกล้เคียงสถานศึกษา";
    W6004 += "\nหรือหอพักบริเวณใกล้เคียงสถานศึกษา ซึ่งได้กำหนดเขตพื้นที่ (Zoning) หรือไม่";
    W6004 += "\nก่อนการออกใบอนุญาต";
var W6005 = "W:W6005:ไม่สามารถออกใบอนุญาตรายใหม่ปี 2559 ได้";
    W6005 += "\nระบบจะออกใบอนุญาตรายใหม่ปี 2559 ได้ตั้งแต่วันที่ 1 มกราคม 2559";
    W6005 += "\nเป็นต้นไป";
var W6006 = "W:W6006:ท่านสามารถออกใบอนุญาตปี 2558 ได้";
    W6006 += "\nโดยจะมีผลบังคับใช้ถึงวันที่ 31 ธันวาคม 2558";   
    W6006 += '\nให้ตรวจสอบสถานที่ขออนุญาตต้องไม่อยู่ในเขตพื้นที่ (Zoning)';
    
var W7001 = "W:W7001:ต้องการสร้างตารางชำระใหม่ ใช่หรือไม่";
var W7002 = "W:W7002:ท่านจะสร้างข้อมูลปรับปรุงประมาณการ (ระบบจะทำการสร้างจำนวนประมาณการรายได้จากอ้างอิงประมาณการครั้งที่ ที่ท่านเลือก) ใช่หรือไม่";
var W7003 = "W:W7003:รวมภาษีสรรพสามิตที่ชำระ ไม่เท่ากับ 1.ภาษีสรรพสามิต ชำระตามแบบจากระบบงานรายได้ ต้องการบันทึกข้อมูล หรือไม่";
var W7004 = "W:W7004:ต้องการสร้างรายการใหม่ทั้งหมด ใช่หรือไม่";
var W7005 = "W:W7005:ท่านยังไม่ได้บันทึก";
var W7006 = "W:W7006:ท่านยังไม่ได้บันทึก รายการเครื่องขายเครื่องดื่ม ต้องการบันทึกแบบสถานะ ครบนำไปวิเคราะห์ ใช่หรือไม่";
var W7007 = "W:W7007:ต้องการบันทึกข้อมูลหรือไม่" ;
       W7007 += "\n\nคำเตือน # ขั้นตอนนี้มีความสำคัญมาก กรุณาอ่านรายละเอียดและยืนยันอีกครั้ง";
       W7007 += "\n                ว่าท่านต้องการทำรายการนี้ต่อไป กดปุ่มด้วยความระมัดระวัง";
       W7007 += "\n\nคำอธิบาย # ถ้าท่านกดปุ่ม [บันทึก] เพื่อต้องการวิเคราะห์รายการภาษีของแบบนี้";
       W7007 += "\n                  ถ้าท่านกดปุ่ม [OK] หมายถึง";
       W7007 += "\n                             ท่านได้วิเคราะห์รายการภาษีแบบนี้ไปแล้ว  และเมื่อ";
       W7007 += "\n                             ระบบงานรายได้ออกใบเสร็จรับเงินแล้ว ท่านจะไม่สามารถแก้ไข";
       W7007 += "\n                             ข้อมูลในแบบนี้ได้อีก ถ้าไม่แน่ใจกรุณาตรวจสอบข้อมูลก่อน";
       W7007 += "\n                  ถ้าท่านกดปุ่ม [Cancel] หมายถึง";
       W7007 += "\n                             ยกเลิกรายการ บันทึกผลการวิเคราะห์นี้ ";
       W7007 += "\n                             ไม่ดำเนินการทำรายการต่อไป";
var W7008 = "W:W7008:ต้องการบันทึกข้อมูลหรือไม่" ;
       W7008 += "\n\nคำเตือน # ขั้นตอนนี้มีความสำคัญมาก กรุณาอ่านรายละเอียดและยืนยันอีกครั้งว่าท่านต้องการทำรายการนี้ต่อไป";
       W7008 += "\n                กดปุ่มด้วยความระมัดระวัง";
       W7008 += "\n\nคำอธิบาย # ถ้าท่านกดปุ่ม [บันทึก] เพื่อต้องการบันทึกข้อมูลของแบบนี้";
       W7008 += "\n                  ถ้าท่านกดปุ่ม [OK] หมายถึง ท่านได้ยินยอมให้ข้อมูลในแบบฯ นี้ นำไปใช้ในการวิเคราะห์รายการภาษีได้";
       W7008 += "\n                                                            และเมื่อถูกนำไปใช้แล้ว ท่านจะไม่สามารถแก้ไขข้อมูลในแบบฯนี้ได้อีก";
       W7008 += "\n                                                            ถ้าไม่แน่ใจกรุณาตรวจสอบข้อมูลก่อน";
       W7008 += "\n\n                  ถ้าท่านกดปุ่ม [Cancel] หมายถึง ยกเลิกรายการ บันทึกนี้ ไม่ดำเนินการทำรายการต่อไป";
var W7009 = "W:W7009:รวมภาษีสรรพสามิตที่ชำระ ไม่เท่ากับ 1.ภาษีสรรพสามิต ชำระตามแบบจากระบบงานรายได้";
      W7009 += "\n             ต้องการบันทึกข้อมูล หรือไม่";
       W7009 += "\n\nคำเตือน # ขั้นตอนนี้มีความสำคัญมาก กรุณาอ่านรายละเอียดและยืนยันอีกครั้งว่าท่านต้องการทำรายการนี้ต่อไป";
       W7009 += "\n                กดปุ่มด้วยความระมัดระวัง";
       W7009 += "\n\nคำอธิบาย # ถ้าท่านกดปุ่ม [บันทึก] เพื่อต้องการบันทึกข้อมูลของแบบนี้";
       W7009 += "\n                  ถ้าท่านกดปุ่ม [OK] หมายถึง ท่านได้ยินยอมให้ข้อมูลในแบบฯ นี้ นำไปใช้ในการวิเคราะห์รายการภาษีได้";
       W7009 += "\n                                                            และเมื่อถูกนำไปใช้แล้ว ท่านจะไม่สามารถแก้ไขข้อมูลในแบบฯนี้ได้อีก";
       W7009 += "\n                                                            ถ้าไม่แน่ใจกรุณาตรวจสอบข้อมูลก่อน";
       W7009 += "\n\n                  ถ้าท่านกดปุ่ม [Cancel] หมายถึง ยกเลิกรายการ บันทึกนี้ ไม่ดำเนินการทำรายการต่อไป";
var W7010 = "W:W7010:ต้องการบันทึกข้อมูลหรือไม่" ;
       W7010 += "\n\nคำเตือน # ขั้นตอนนี้มีความสำคัญมาก กรุณาอ่านรายละเอียดและยืนยันอีกครั้งว่าท่านต้องการทำรายการนี้ต่อไป";
       W7010 += "\n                กดปุ่มด้วยความระมัดระวัง";
       W7010 += "\n\nคำอธิบาย # ถ้าท่านกดปุ่ม [บันทึก] เพื่อต้องการวิเคราะห์รายการภาษีของแบบ ภษ.01-12 นี้";
       W7010 += "\n                  ถ้าท่านกดปุ่ม [OK] หมายถึง ท่านได้วิเคราะห์รายการภาษีแบบนี้ไปแล้วและจะไม่สามารถ";
       W7010 += "\n                                                            แก้ไขข้อมูลในแบบ ภษ.01-12 ได้";
       W7010 += "\n                                                            ถ้าไม่แน่ใจกรุณาตรวจสอบข้อมูลก่อน";
       W7010 += "\n\n                  ถ้าท่านกดปุ่ม [Cancel] หมายถึง ยกเลิกรายการ บันทึกผลการวิเคราะห์นี้ ไม่ดำเนินการทำรายการต่อไป";
var W7011 = "W:W7011:ต้องการบันทึกข้อมูลหรือไม่" ;
       W7011 += "\n\nคำเตือน # ขั้นตอนนี้มีความสำคัญมาก กรุณาอ่านรายละเอียดและยืนยันอีกครั้งว่าท่านต้องการทำรายการนี้ต่อไป";
       W7011 += "\n                กดปุ่มด้วยความระมัดระวัง";
       W7011 += "\n\nคำอธิบาย # ถ้าท่านกดปุ่ม [บันทึก] เพื่อต้องการวิเคราะห์รายการภาษีของแบบ ภษ.01-12ก นี้";
       W7011 += "\n                  ถ้าท่านกดปุ่ม [OK] หมายถึง ท่านได้วิเคราะห์รายการภาษีแบบนี้ไปแล้วและจะไม่สามารถ";
       W7011 += "\n                                                            แก้ไขข้อมูลในแบบ ภษ.01-12ก ได้";
       W7011 += "\n                                                            ถ้าไม่แน่ใจกรุณาตรวจสอบข้อมูลก่อน";
       W7011 += "\n\n                  ถ้าท่านกดปุ่ม [Cancel] หมายถึง ยกเลิกรายการ บันทึกผลการวิเคราะห์นี้ ไม่ดำเนินการทำรายการต่อไป";
var W7012 = "W:W7012:ท่านเลือกรหัสรายได้ ไม่ตรงกับรหัสกลุ่มสินค้า";
var W7013 = "W:W7013:ท่านต้องการทำพิมพ์ใบเสร็จใหม่ ทดแทนใบเสร็จเสีย ใช่หรือไม่";
var W7014 = "W:W7014:ท่านต้องการทำใบเสร็จเสีย โดยไม่พิมพ์ใบเสร็จใหม่ ใช่หรือไม่";
var W7015 = "W:W7015:ยอดเงินรวมภาษีที่ชำระ มากกว่า ยอดเงินรวมภาษีที่ต้องชำระ ท่านต้องการทำรายการใช่หรือไม่";
var W7016 = "W:W7016:ท่านต้องการเปลี่ยนการแจ้งราคา ใช่หรือไม่ ถ้าท่านเปลี่ยน รายการสินค้าด้านล่างจะถูกลบทิ้งทั้งหมด";
var W7017 = "W:W7017:ท่านได้ทำรายการบันทึกหรือลบข้อมูลซ้ำ กรุณาตรวจสอบรายการที่ทำค้างไว้ก่อนทำรายการใหม่";
var W7018 = "W:W7018:ท่านต้องการสร้างใบนำฝาก ใช่หรือไม่";
var W7019 = "W:W7019:มีข้อมูลใบนำฝากอยู่แล้ว ท่านต้องการลบ และสร้างใบนำฝากใหม่ ใช่หรือไม่";
var W7020 = "W:W7020:ท่านต้องการ \"ยืนยัน\" การประมวลผลนำเงินฝากคลัง ใช่หรือไม่";
var W7021 = "W:W7021:ท่านต้องการ \"ยกเลิก\" การประมวลผลนำเงินฝากคลัง ใช่หรือไม่";
var W7022 = "W:W7022:มีข้อมูลเลขที่อ้างอิงนำส่งคลังแล้ว\nท่านต้องการ \"ยกเลิก\" การประมวลผลนำเงินฝากคลัง ใช่หรือไม่";
var W7023 = "W:W7023:ท่านต้องการประมวลผลจัดเก็บรายได้ ใช่หรือไม่";
var W7024 = "W:W7024:มีข้อมูลการประมวลผลจัดเก็บรายได้อยู่แล้ว\nท่านต้องการประมวลผลจัดเก็บรายได้ ใช่หรือไม่";
var W7025 = "W:W7025:ท่านต้องการ \"ยืนยัน\" การประมวลผลจัดเก็บให้ภาค ใช่หรือไม่";
var W7026 = "W:W7026:ท่านต้องการ \"ยกเลิก\" การยืนยันการประมวลผลจัดเก็บให้ภาค ใช่หรือไม่";
var W7027 = "W:W7027:ท่านต้องการ \"ยืนยัน\" การสร้างไฟล์ ใช่หรือไม่";
var W7028 = "W:W7028:ท่านต้องการประมวลผลนำส่งให้ภาค ใช่หรือไม่";
var W7029 = "W:W7029:มีข้อมูลการประมวลผลนำส่งรายได้อยู่แล้ว\nท่านต้องการประมวลผลนำส่งรายได้ ใช่หรือไม่";
var W7030 = "W:W7030:ท่านต้องการ \"ยืนยัน\" การประมวลผลนำส่งให้ภาค ใช่หรือไม่";
var W7031 = "W:W7031:ท่านต้องการ \"ยกเลิก\" การยืนยันการประมวลผลนำส่งให้ภาค ใช่หรือไม่";
var W7032 = "W:W7032:ท่านต้องการ \"ยืนยัน\" เลขที่อ้างอิงพักหน่วยงาน ใช่หรือไม่";
var W7033 = "W:W7033:ท่านต้องการ \"ยกเลิก\" การยืนยันเลขที่อ้างอิงพักหน่วยงาน ใช่หรือไม่";
var W7034 = "W:W7034:ยืนยันการแก้ไขข้อมูล";
var W7035 = "W:W7035:ยืนยันการล้างข้อมูล";
var W7036 = "W:W7036:ยืนยันการจบการทำงาน";
var W7037 = "W:W7037:ยืนยันยกเลิกการแก้ไขข้อมูล";
var W7038 = "W:W7038:กรุณาตรวจสอบประเภทใบนำฝากบัญชีพักหน่วยงาน ให้ถูกต้องก่อน";
var W7039 = "W:W7039:กรุณาตรวจสอบ เดือน/ปี ภาษี ให้ตรงกับแบบชำระภาษีด้วย";
var W7040 = "W:W7040:ท่านต้องการใช้ผู้ประกอบการรายนี้ใช่หรือไม่";
var W7041 = "W:W7041:ก่อนปิดสิ้นวัน เจ้าหน้าที่ต้องทำการตรวจสอบรายงานประจำวันให้ถูกต้อง เช่น\n   1. รายงานผลการจัดเก็บรายได้\n   2. รายงานสรุปใบเสร็จรับเงิน\n   3. รายงานทะเบียนรับเช็คและเงินสด\n   4. รายงานสรุปภาษีอบจ. (ถ้ามีการรับชำระ)";
var W7042 = "W:W7042:กรุณาตรวจสอบ เนื่องจากหมายเลขเครื่อง / แชสซีย์ซ้ำ";
var W7043 = "W:W7043:ท่านต้องการ \"ยืนยัน\" ข้อมูลหมายเลขเครื่อง / แชสซีย์ ใช่หรือไม่";
var W7044 = "W:W7044:ท่านต้องการ \"ยกเลิกการยืนยัน\" ข้อมูลหมายเลขเครื่อง / แชสซีย์ ใช่หรือไม่";
var W7045 = "W:W7045:กรุณาตรวจสอบ พื้นที่เจ้าของเงิน เนื่องจากไม่ตรงกับ พื้นที่รับเงิน";
var W7046 = "W:W7046:สถานะการวิเคราะห์ \"ระหว่างรอดำเนินการ\"";
var W7047 = "W:W7047:กรุณาเลือกสถานะอนุมัติอย่างน้อย 1 รายการ";





var W8001 = "W:W8001:เกินอำนาจอนุมัติไม่สามารถทำการอนุมัติได้ ต้องการแก้ไขหรือไม่\nถ้าต้องการแก้ไข กดปุ่ม OK \nถ้าต้องการบันทึก กดปุ่ม Cancel" ;
var W8002 = "W:W8002:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ\n อาจมีสาเหตุมาจาก \n1. ยังไม่ได้ทำการบันทึกข้อมูล ภษ.01-28/1 หรือ ภษ.01-36/1 \n2. ระบุสถานที่เก็บสินค้าไม่ตรงกับที่นำสินค้าออก\n3. สินค้าที่ต้องการขนออกถูกเก็บไว้ในสถานที่เก็บเกิน 6 เดือน" ;
var W8003 = "W:W8003:ภาษีที่ระบุแตกต่างจากที่ระบบคำนวณได้เกิน 1 บาท" ;
var W8004 = "W:W8004:ยืนยันการบันทึกเลขที่อนุญาต กค.";
var W8005 = "W:W8005:ต้องการลบรายการทั้งหมดหรือไม่";
var W8006 = "W:W8006:บันทึกรายการยกเว้นภาษี/ลดอัตราภาษีไม่ครบตามปริมาณที่คิดภาษี ต้องการส่งข้อมูลหรือไม่" ;
var W8007 = "W:W8007:รายการสินค้าที่เลือกมีอยู่แล้ว";                   // เพิ่มไว้ใช้ในหน้า rtne0048_t1.jsp  ramoslee.b 20/09/2559
var W8008 = "W:W8008:ต้องการลบใบแจ้งการรับ/จ่ายน้ำมันฯ (น.ม.1) ทั้งหมดหรือไม่";
var W8009 = "W:W8009:ต้องการลบข้อมูลการรับ/จ่ายน้ำมันฯ (น.ม.11) หรือไม่";
var W8010 = "W:W8010:ต้องการลบข้อมูลการขนน้ำมันฯหรือไม่";

var W8011 = "W:W8011:ถังเลขที่ ต้องไม่ซ้ำกับที่ระบุ กรุณาระบุข้อมูลใหม่";
var W8012 = "W:W8012:ประเทศ ต้องไม่ซ้ำกับที่ระบุ กรุณาระบุข้อมูลใหม่";
var W8013 = "W:W8013:อื่นๆ และจังหวัด ต้องไม่ซ้ำกับที่ระบุ กรุณาระบุข้อมูลใหม่";
var W8014 = "W:W8014:เลขทะเบียนสรรพสามิตนี้ไม่อยู่ในกลุ่มสินค้าที่กำหนดไว้";
var W8015 = "W:W8015:เลขทะเบียนสรรพสามิต ต้องไม่ซ้ำกับที่ระบุ กรุณาระบุข้อมูลใหม่";
var W8016 = "W:W8016:ไม่พบเลขทะเบียนสรรพสามิตนี้ในฐานข้อมูล";
var W8017 = "W:W8017:ทะเบียนรับเลขที่ และลงวันที่ ต้องไม่ซ้ำกับที่ระบุ กรุณาระบุข้อมูลใหม่";
var W8018 = "W:W8018:เลขทะเบียนสรรพสามิตนี้ไม่อยู่ในโรงอุตสาหกรรม/คลังน้ำมัน/โรงงานผลิตเครื่องหมาย ที่ได้รับมอบหมาย";


var W9001 = "W:W9001:ยังไม่ดำเนินการงบเดือน ไม่สามารถพิมพ์แบบได้";
var W9002 = "W:W9002:ออกงบเดือนแล้ว ต้องการแก้ไขหรือไม่";
var W9003 = "W:W9003:ท่านเคยประมวลบัญชีประจำวันของเดือนนี้แล้ว \n ต้องการประมวลผลซ้ำหรือไม่ ";


var I0001 = "I:I0001:บันทึกข้อมูลเรียบร้อยแล้ว";
var I0002 = "I:I0002:ลบข้อมูลเรียบร้อยแล้ว";
var I0003 = "I:I0003:ไม่สามารถบันทึกข้อมูลได้";
var I0004 = "I:I0004:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ";     
var I0005 = "I:I0005:ไม่สามารถลบข้อมูลได้";
var I0006 = "I:I0006:ท่านไม่มีสิทธิเข้าใช้ระบบงาน";
var I0007 = "I:I0007:เกิดข้อผิดพลาดขณะค้นหาข้อมูล";
var I0008 = "I:I0008:ยกเลิกแบบเรียบร้อยแล้ว";
var I0009 = "I:I0009:ยืนยันการบันทึกข้อมูล";
var I0010 = "I:I0010:ยืนยันการลบข้อมูล";
var I0011 = "I:I0011:กำลังประมวลผลกรุณารอสักครู่";
var I0012 = "I:I0012:ยืนยันการพิมพ์";
var I0013 = "I:I0013:เกิดข้อผิดพลาดขณะประมวลผล";
var I0014 = "I:I0014:เกิดข้อผิดพลาดขณะดึงข้อมูลจากฐานข้อมูล";
var I0015 = "I:I0015:ข้อมูลถูกต้อง";
var I0016 = "I:I0016:ออกงบเดือนแล้ว ไม่สามารถแก้ไขได้";

var I4001 = "I:I4001:กรุณาระบุข้อมูลเพื่อใช้ในการค้นหา";
var I4002 = "I:I4002:เคยถูกเพิกถอนใบอนุญาตและยังไม่เกิน 3 ปี"; 
var I4003 = "I:I4003:ไม่พบข้อมูลการเคยถูกเพิกถอนใบอนุญาต";
var I4004 = "I:I4004:ไม่พบข้อมูลการการค้างจดทะเบียนสรรพสามิตใหม่"; 
var I4005 = "I:I4005:ไม่พบข้อมูลการใช้บริการผ่านทาง internet"; 
var I4006 = "I:I4006:Export ข้อมูลเรียบร้อย"; 
var I4007 = "I:I4007:ไม่พบข้อมูลการจดทะเบียนสรรพสามิต";
var I4008 = "I:I4008:ไม่พบข้อมูลเลขประจำตัวผู้เสียภาษีนี้จากฐานข้อมูลกรมสรรพากร";
var I4009 = "I:I4009:ไม่พบข้อมูลเลขประจำตัวประชาชนนี้จากฐานข้อมูลกระทรวงมหาดไทย";
var I4010 = "I:I4010:ไม่พบข้อมูลเลขรหัสประจำบ้านนี้จากฐานข้อมูลกระทรวงมหาดไทย";
var I4011 = "I:I4011:ไม่พบข้อมูลเลขทะเบียนนิติบุคคลนี้จากฐานข้อมูลกระทรวงพาณิชย์";
var I4012 = "I:I4012:ส่งอนุมัติเรียบร้อยแล้ว";

var I5001 = "I:II5001:คำขอซื้อ และใบอนุญาตให้ซื้อเครื่องหมายแสดงการเสียภาษีจดทะเบียน ภษ.๐๑-๒๓";
var I5002 = "I:I5002:จำนวนเครื่องหมายที่ขอขนมากกว่าจำนวนเครื่องหมายที่ผลิต";
var I5003 = "I:I5003:บันทึกการใช้งานเรียบร้อย";
var I5004 = "I:I5004:เกิดข้อผิดพลาดขณะบันทึกการใช้งาน";

var I6001 = "I:I6001:โหลดข้อมูลเรียบร้อยแล้ว";   
var I6002 = "I:I6002:เกิดข้อผิดพลาดขณะโหลดข้อมูล";
var I6003 = "I:I6003:เกิดข้อผิดพลาดขณะ Upload ไฟล์";

var I7001 = "I:I7001:ยอดเงินภาษีสรรพสามิตที่ชำระจริง ไม่เท่ากับยอดเงินภาษีสรรพสามิตที่ต้องชำระ"
var I7002 = "I:I7002:ยอดเงินภาษีเพื่อมหาดไทยที่ชำระจริง ไม่เท่ากับยอดเงินภาษีเพื่อมหาดไทยที่ต้องชำระ"
var I7003 = "I:I7003:รับชำระหลังปิดบัญชี";
var I7004 = "I:I7004:กรุณาเลือกรายการพิมพ์";
var I7005 = "I:I7005:ยืนยันการพิมพ์ใบเสร็จ";
var I7006 = "I:I7006:ยืนยันการพิมพ์บนแบบ";
var I7007 = "I:I7007:ประมวลผลเรียบร้อยแล้ว";
var I7008 = "I:I7008:ยกเลิกการปิดสิ้นวันเรียบร้อยแล้ว";
var I7009 = "I:I7009:ไม่พบข้อมูลปิดงานสิ้นวัน";
var I7010 = "I:I7010:ยืนยันการพิมพ์ใบเสร็จเสีย";
var I7011 = "I:I7011:ยกเลิกเรียบร้อยแล้ว";
var I7012 = "I:I7012:ยืนยันการบันทึกข้อมูล";// ถ้าท่านยังไม่ได้กดปุ่ม [ตกลง] ให้กดปุ่ม [Cancel] เพื่อไปทำการกดปุ่ม [ตกลง]
//var I7013 = "I:I7013:ยืนยันการเพิ่มรายการ ถ้าท่านยังไม่ได้กดปุ่ม [ตกลง] ให้กดปุ่ม [Cancel] เพื่อไปทำการกดปุ่ม [ตกลง]";
var I7013 = "I:I7013:กรุณากดปุ่ม [ตกลง] ก่อนกดปุ่ม [เพิ่ม]";
var I7014 = "I:I7014:ท่านยังไม่ได้ระบุ วันที่หนังสือ / เลขที่ประเมิน ของแบบประเมิน";
var I7015 = "I:I7015:ยืนยันการยกเลิกปิดสิ้นวัน";
var I7016 = "I:I7016:ไม่พบข้อมูล เนื่องจากไม่มีการรับชำระภาษี ตามวันที่จัดเก็บ";
var I7017 = "I:I7017:ยกเลิกการประมวลผลเรียบร้อยแล้ว";
var I7018 = "I:I7018:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ เนื่องจากไม่มีรายการรับชำระ"; // not use
var I7019 = "I:I7019:ยืนยันการประมวลผลเรียบร้อยแล้ว";
var I7020 = "I:I7020:ยกเลิกการยืนยันการประมวลผลเรียบร้อยแล้ว";
var I7021 = "I:I7021:ยืนยันการสร้างไฟล์เรียบร้อยแล้ว";
var I7022 = "I:I7022:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ เนื่องจากยังไม่ยืนยันเลขที่อ้างอิงนำเงินฝากคลัง";
var I7023 = "I:I7023:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ เนื่องจากมีใบนำฝากที่ยังไม่ยืนยันเลขที่อ้างอิงพักหน่วยงาน";
var I7024 = "I:I7024:ไม่มีข้อมูลที่พร้อมจะประมวลผลนำเงินฝากคลัง";
var I7025 = "I:I7025:ยืนยันเลขที่อ้างอิงพักหน่วยงานเรียบร้อยแล้ว";
var I7026 = "I:I7026:ยกเลิกยืนยันเลขที่อ้างอิงพักหน่วยงานเรียบร้อยแล้ว";
var I7027 = "I:I7027:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ เนื่องจากไม่มีรายการสรุปผลนำเงินฝากคลัง";
var I7028 = "I:I7028:ท่านพิมพ์ใบนำฝากบัญชีพักหน่วยงานยังไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7029 = "I:I7029:ท่านบันทึกเลขที่อ้างอิงพักหน่วยงานยังไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7030 = "I:I7030:สร้างใบนำฝากเรียบร้อยแล้ว";
var I7031 = "I:I7031:ท่านยังไม่ได้สร้างใบนำฝากเงินบัญชีพักหน่วยงาน";
var I7032 = "I:I7032:ท่านยังไม่ได้พิมพ์ใบนำฝากเงินบัญชีพักหน่วยงาน";
var I7033 = "I:I7033:ท่านยังไม่ได้สร้าง / พิมพ์ใบนำฝากเงินบัญชีพักหน่วยงาน";
var I7034 = "I:I7034:ท่านยังสร้างใบนำฝากเงินบัญชีพักหน่วยงานไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7035 = "I:I7035:ท่านยังพิมพ์ใบนำฝากเงินบัญชีพักหน่วยงานไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7036 = "I:I7036:ท่านยังสร้าง / พิมพ์ใบนำฝากเงินบัญชีพักหน่วยงานไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7037 = "I:I7037:ท่านยังไม่ได้บันทึก / สร้างใบนำฝาก / พิมพ์ใบนำฝากบัญชีพักหน่วยงาน";
var I7038 = "I:I7038:ท่านยังไม่ได้ทำการปิดบัญชีสิ้นวัน";
var I7039 = "I:I7039:บันทึกวันที่นำฝากเรียบร้อยแล้ว";
var I7040 = "I:I7040:ท่านยังไม่ได้สร้าง / พิมพ์ใบนำฝาก / บันทึกเลขที่อ้างอิงบัญชีพักหน่วยงาน";
var I7041 = "I:I7041:ท่านยังไม่ได้พิมพ์ใบนำฝาก / บันทึกเลขที่อ้างอิงบัญชีพักหน่วยงาน";
var I7042 = "I:I7042:ท่านยังไม่ได้บันทึกเลขที่อ้างอิงบัญชีพักหน่วยงาน";
var I7043 = "I:I7043:ท่านยังสร้าง / พิมพ์ใบนำฝาก / บันทึกเลขที่อ้างอิงบัญชีพักหน่วยงานไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7044 = "I:I7044:ท่านยังพิมพ์ใบนำฝาก / บันทึกเลขที่อ้างอิงบัญชีพักหน่วยงานไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7045 = "I:I7045:ท่านยังบันทึกเลขที่อ้างอิงบัญชีพักหน่วยงานไม่ครบทุกรายการ ตามวันที่จัดเก็บ";
var I7046 = "I:I7046:ท่านยังไม่ประมวลผลเพื่อสรุปจำนวนเงินนำฝากคลัง";
var I7047 = "I:I7047:ท่านยังไม่พิมพ์ใบนำฝากบัญชี อบจ.";
var I7048 = "I:I7048:พบรายการยังไม่ปิดบัญชีสิ้นวัน";
var I7049 = "I:I7049:ปริมาณต้องไม่เกินปริมาณที่ชำระ";
var I7050 = "I:I7050:จำนวนเงินหักลดหย่อนรวมต้องไม่เกินภาษีสรรพสามิตที่ชำระ";
var I7051 = "I:I7051:ยืนยันข้อมูลหมายเลขเครื่อง / แชสซีย์เรียบร้อยแล้ว";
var I7052 = "I:I7052:ยกเลิกการยืนยันข้อมูลหมายเลขเครื่อง / แชสซีย์เรียบร้อยแล้ว";
var I7053 = "I:I7053:พบข้อมูลเลขที่ใบขนสินค้านี้ในระบบ ยืนยันการนำเข้าข้อมูลหรือไม่";
var I7054 = "I:I7054:อนุมัติยกเลิกปิดสิ้นวันเรียบร้อยแล้ว";
var I7055 = "I:I7055:ยืนยันยกเลิกการอนุมัติ";
var I7056 = "I:I7056:ยืนยันการอนุมัติเรียบร้อยแล้ว";
var I7057 = "I:I7057:สร้างใบเสร็จรับเงิน (PDF) เรียบร้อยแล้ว";
var I7058 = "I:I7058:ยกเลิกรายการ เรียบร้อยแล้ว";
var I7059 = "I:I7059:ไม่พบคำขอชำระภาษีรวม";
var I7060 = "I:I7060:ไม่พบคำขอชำระภาษีภายในวันที่15ของเดือนถัดไป";

var I8001 = "I:I8001:ไม่สามารถทำการบันทึกข้อมูลได้ เนื่องจากข้อมูลได้รับการอนุมัติเรียบร้อยแล้ว";
var I8002 = "I:I8002:วันที่ขอคืนเกิน 60 วัน กรุณาทำการขยายเวลา";
var I8003 = "I:I8003:ไม่สามารถทำการลบข้อมูลได้ เนื่องจากข้อมูลได้รับการอนุมัติเรียบร้อยแล้ว";
var I8004 = "I:I8004:ไม่สามารถเรียกดูข้อมูลได้เนื่องจากเป็นรายการที่ไม่มีโครงสร้างต้นทุน";




// update 13/06/2555 by nichao
var I8005 = "I:I8005:ไม่สามารถยกเลิก หนังสือ กค. ที่ต้องการ เนื่องจากถูกใช้งานไปแล้ว";

////msgCode for sendNsw
var I8006 = "I:I8006:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Lincense Number";
var I8007 = "I:I8007:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Lincense Issue Authority ";
var I8008 = "I:I8008:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Lincense Type";
var I8009 = "I:I8009:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Issue Date";
var I8010 = "I:I8010:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Company Tax Number";
var I8011 = "I:I8011:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Start Date";
var I8012 = "I:I8012:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Expire Date";
var I8013 = "I:I8013:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Lincense Name";
var I8014 = "I:I8014:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า UID Transmit";
var I8015 = "I:I8015:ไม่สามารถส่งข้อมูลได้ เนื่องจากสร้างไฟล์ไม่สำเร็จ "; //Rollback While create document
var I8016 = "I:I8016:ไม่สามารถส่งข้อมูลได้ เนื่องจากสถานะการบันทึก ";//Rollback While save history
var I8017 = "I:I8017:ไม่สามารถส่งข้อมูลได้ เนื่องจากสถานะของข้อมูล ";//Rollback While  update status
var I8018 = "I:I8018:ไม่สามารถส่งข้อมูลได้ เนื่องจากเกิดข้อผิดพลาดขณะสร้างไฟล์ ";//Rollback While move file
var I8019 = "I:I8019:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่พบข้อมูล ";
var I8020 = "I:I8020:ส่งข้อมูลเรียบร้อยแล้ว ";
var I8021 = "I:I8021:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Invoice Number";
var I8022 = "I:I8022:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Invoice Date";
var I8023 = "I:I8023:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Invoice Item";
var I8024 = "I:I8024:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า English Description Of Goods";
var I8025 = "I:I8025:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Quantity";
var I8026 = "I:I8026:ไม่สามารถส่งข้อมูลได้ เนื่องจากไม่มีค่า Quantity Unit";


var I8027 = "I:I8027:ยืนยันการบันทึกข้อมูล\nข้อมูลที่ระบุถูกต้องแล้ว ต้องการบันทึกข้อมูล กดปุ่ม OK\nต้องการกลับไปตรวจสอบ/แก้ไข กดปุ่ม Cancel";
// update 07/01/2559 by tai
var I8028 = "I:I8028:ภาค/พื้นที่ไม่ตรงกัน ไม่สามารถทำรายการได้";



///////////////////////////////////////////////// Error_Warning.js ////////////////////////////////
var messageLanguage = 2;
// Insert by Prawith
// กรณีหลาย ๆ Field ที่มี Err เหมือนกัน
// เช่น อัตราชดเชยกรมศุลฯ และ อัตรานำส่งกองทุน
// ค่าที่บันทึกได้ต้องไม่เกิน 100.00
function showMsgField( code, field ) {

     arr = code.split(":");
     typDesc = getTypeDesc(arr[0]); 
//     mesg = typDesc + "\n\n" + arr[1] + ": " + field + " " + arr[messageLanguage] + "";
     mesg = arr[1] + ": " + field + " " + arr[messageLanguage] + "";
     return mesg;
}
function showMsg( code ){

     arr = code.split(":");
     typDesc = getTypeDesc(arr[0]); 
//     mesg = typDesc + "\n" + "\n" + arr[1] + ": " + arr[messageLanguage] + "";
     mesg = arr[1] + ": " + arr[messageLanguage] + "";
     return mesg;
}

function showTypeDesc( code ){
     arr = code.split(":");
     typDesc = getTypeDesc(arr[0]); 
     return typDesc;
}

function getTypeCode( code ){
     arr = code.split(":");
     return arr;
}

function getTypeDesc(codeType) {
	strType = "";
	if( codeType == "W" ) {
		if( messageLanguage == 2 ){
		     strType = "ข้อความเตือน";
		} else {
			 strType = "Warning";
		}
	}	
	if( codeType == "E" ) {
		if( messageLanguage == 2 ){
		     strType = "ข้อความปฏิเสธ";
		} else {
			 strType = "Error";
		}
	}
	if( codeType == "I" ) {
		if( messageLanguage == 2 ){
		     strType = "ข้อความจากระบบ";
		} else {
			 strType = "Information";
		}
	}
	
	return strType;
}
/**
* ส่ง parameter :  param = E#E7011:วันที่รับ ตั้งแต่ ต้องไม่มากกว่า วันที่รับ ถึง
* การเรียกใช้ message ที่ jsp คือ alert(showMessage(param));
* เหตุผลการสร้าง การเรียกใช้ Function กลาง อาจทำให้มีการใช้ message code ที่แตกต่างกัน
**/
function showMessage( message ){

     arr = message.split("#");
     typHead = getTypeDesc(arr[0]); 
     typDesc = arr[1];
     mesg = typHead + "\n" + "\n" + arr[1];
     return mesg;
}

//Nattakrit c.
